{"all_questions": [["Chris Williams last played for which football club from the National League North?", "Is the Pakistan fast bowler who joined the Kent County Cricket Club in June, 2011 a left-hand or right-hand batsmans?", "What company did Roscoe Channing form with the owner of a leading stable of thoroughbred racehorses?", "Jack Alfred Evans played with a football club team that is based in what city in Australia?", "Where was the coach of the 1999 Oklahoma State Cowboys football team hired in 2013?", " Billy Preston is an American college basketball player for a team that competes in what?", "What ethnicity is this American professional baseball right fielder born in 1987 play, who graduated from Nova Southeastern University?", " The 2011–12 Houston Rockets season began with the drafting of the player who now plays for what team?", "What team plays within the Big 12 Conference and has Kevin Bookout playing for them?", "Syracuse Orange men's basketball team was part of a conference that participated in how many total sports?", "Hamilton Wanderers AFC has a former player that is vice captain for what team?", "In what Country is Sul America Esporte Clube in?", "What Swiss football forward currently plays for the Swiss football club founded in 1905?", "In which city have Gary Ayres and Neil Craig both been head coach of the Crows?", "Which team did Art Briles lead to a victory at the Orlando Citrus Bowl on December 29, 2015?", "An American football quarterback for the Chicago Bears was a star of a game released when?", "What 2014 Ottawa Fury goalkeeper coach missed a shot deflected off Ronnie Whelan in the 1987 Football League Cup Final?"], ["Martin Patterson 'Pat' Hingle was a close friend of an actor who achieved success in what Western TV series? ", "Jamie Harris is best known for his role as The Hook-Handed Man in a movie directed by who ?", "Armageddon in Retrospect was written by the author who was best known for what 1969 satire novel?", "In what city was the Italian Baroque composer who composed a set of sonatas, titled Op. 5, born?", "I'd Come for You is a single by the band formed in what Alberta city?", "In what 1997 American mystery crime film did Johnny Galecki start in?", "'Ew!' is a song by a television host born where?", "Two positions were filled in The Voice of Ireland b which British-Irish girl group based in London, England?", "Rock Springs is a collection of short stories by an author born in what year?", "Mamie Gummer played the role of Nancy Crozier on the TV series airing on what network?", "Who is the current drummer of the band who did the song 'What Lovers Do'?", "What 2017 Christopher B. Landon directed American slasher film is Jessica Rothe starring in?", "when was the album that includes the song by Dustin Lynch released to country radio on February 17, 2017?", "Vanessa Bley is what person who organizes and often finances concerts, plays, or operas, performing a role?", "What year was the film 'Mom' released, starring the voice of Shashaa Tirupati?"], ["Who was Chamberlain and Colonel of the military staff of The Merrie Monarch?", "From March 631 to April 631, Farrukhzad Khosrau V was the king of an empire that succeeded which empire?", "Salisbury Woodland Gardens links a zoo with a park designed and built under the watchful eye of who?", "What is Opry Mills in Nashville, Tennessee?", "To which aircraft carrier was the VMF-213 Marine Fighting Squadron assigned to durning World War II?", "The northern English anglian Kingdom in the Humber estuary spoke what dialect of english?", "What Kentucky county has a population of 60,316 and features the Lake Louisvilla neighborhood?", "What is the capacity of the Stadium, other than Kauffman Stadium, designed by Charles Deaton ? ", "Bartlett's Bridge was built by the engineer who worked for the county seat of which Massachusetts county?", "The Waterloo Vase has been used as a garden ornament at whose residence and administrative headquarters?", "What country does Eric A. Sykes and Eccles, Greater Manchester have ion common?", "What criteria subjectively qualifies the Houston Astrodome to be called the Eighth Wonder of the World?", "What created the terrirtories of Kansas and Nebraska and was combated by the The Republican Party?", "The Greatest Event in Television History aired on the channel that was founded by whom?", "California joined the Union due to the passage of a package of how many separate bills?"]], "context_questions": ["2014 S/S is the debut album of a South Korean boy group that was formed by who?", "Who was known by his stage name Aladin and helped organizations improve their performance as a consultant?", "Brown State Fishing Lake is in a country that has a population of how many inhabitants ?", "Kaiser Ventures corporation was founded by an American industrialist who became known as the father of modern American shipbuilding?", "Vince Phillips held a junior welterweight title by an organization recognized by what larger Hall of Fame?", "What color clothing do people of the Netherlands wear during Oranjegekte or to celebrate the national holiday Koningsdag? ", "What is the middle name of the actress who plays Bobbi Bacha in Suburban Madness?", "In which year was the King who made the 1925 Birthday Honours born?", "In what year was the novel that Lourenço Mutarelli based 'Nina' on based first published?", "Bordan Tkachuk was the CEO of a company that provides what sort of products?", "Which American film actor and dancer starred in the 1945 film Johnny Angel?", "When was the  former Indian cricketer who made his ODI debuts during the 2000 ICC KnockOut Trophy born? ", "In which role did Caroline Carver played in a 1999 Hallmark Entertainment made-for-TV fantasy movie?", "Where is the Bubblegum Alley, that is similar to Gum Wall, located in California?", "SuperMansion starred the actress who had a recurring role as whom on Workaholics?", "When did the English local newspaper, featuring the sculpture and war memorial in the Forbury gardens, change names?", "Where was the world cup hosted that Algeria qualified for the first time into the round of 16?", "What British singer-songwriter hosted the 16th Annual Young Hollywood Awards?", "What is the birthplace of the Senator who represents the first of 62 districts in the State Senate?", "Tefik Selim Mborja was a part of a party that held power in Albania until what year? "], "all_contextss": [[{"title": "Salford City F.C.", "paragraph": "Salford City Football Club is a professional football club in the Kersal area of Salford, Greater Manchester, England, which plays in National League North, the sixth tier of English football."}, {"title": "Chris Williams (English footballer)", "paragraph": "Christopher Jonathan 'Chris' Williams (born 2 February 1985) is an English semi-professional footballer who last played for Salford City as a forward."}, {"title": "Wahab Riaz", "paragraph": "Wahab Riaz (Punjabi, Urdu: ‎ ; born 28 June 1985) is a Pakistani cricketer.  He is a left-arm fast bowler and a right-hand batsman.  He frequently bowls at speeds of around 90 mph and has reached 96 mph ."}, {"title": "Kent County Cricket Club in 2011", "paragraph": "In 2011, Kent County Cricket Club competed in Division Two of the County Championship, Group A of the 40-over Clydesdale Bank 40 and the South Group of the Friends Life t20.  Kent also hosted a Twenty20 match at the St Lawrence Ground against the touring Indians, and a three-day first-class MCC Universities match against Loughborough MCCU, also at the St Lawrence Ground.  It was the second and final season in charge for Director of Cricket Paul Farbrace.  The club captain was former England batsman Rob Key who had been club captain since 2006.  Pakistan fast bowler Wahab Riaz joined Kent as their overseas player in June, and another fast bowler, South African Charl Langeveldt, signed as Kent's second overseas player for the Friends Life t20 competition only."}, {"title": "Cornelius Vanderbilt Whitney", "paragraph": "Cornelius Vanderbilt 'C.V.' ('Sonny') Whitney (February 20, 1899 – December 13, 1992) was an American businessman, film producer, writer, philanthropist, polo player, and government official, as well as the owner of a leading stable of thoroughbred racehorses."}, {"title": "Roscoe Channing", "paragraph": "Roscoe H. Channing, Jr. (January 7, 1868 – April 1, 1961) was an All-American football player, member of the Rough Riders and mining executive.  Channing was an All-American halfback for Princeton University.  He was one of eleven players selected by Caspar Whitney for the first ever College Football All-America Team in 1889.  When the Spanish–American War commenced in 1898, Channing enlisted in Theodore Roosevelt's Rough Riders.  Roosevelt took pride in how many Ivy League football players enlisted in the Rough Riders.  Channing later went into the mining business and managed the mining operations of the Whitney family.  In the 1920s, he formed a partnership with his friend Cornelius Vanderbilt Whitney.  The two formed the Hudson Bay Mining and Smelting Company in Flin Flon, Saskatchewan, Canada, and Channing served as the company's President.  Channing died in 1961."}, {"title": "Jack Evans (footballer, born 1930)", "paragraph": "Jack Alfred Evans (born 11 October 1930) was an Australian rules footballer who played with St Kilda in the Victorian Football League (VFL)."}, {"title": "St Kilda Football Club", "paragraph": "The St Kilda Football Club, nicknamed the Saints, is an Australian rules football club based in Melbourne, Victoria, Australia.  The club plays in the Australian Football League, the sport's premier league."}, {"title": "1999 Oklahoma State Cowboys football team", "paragraph": "The 1999 Oklahoma State Cowboys football team represented Oklahoma State University during the 1999 NCAA Division I-A football season.  They participated as members of the Big 12 Conference in the South Division.  They played their home games at Lewis Field in Stillwater, Oklahoma.  They were coached by head coach Bob Simmons."}, {"title": "Bob Simmons (American football coach)", "paragraph": "Bob Simmons (born June 13, 1948) is a former American football player and coach.  He served as the head football coach at Oklahoma State University–Stillwater from 1995 to 2000, compiling a record of 30–38.  In 2013, he was hired as the head football coach at Boulder High School in Boulder, Colorado."}, {"title": "Kansas Jayhawks men's basketball", "paragraph": "The Kansas Jayhawks men's basketball program is the intercollegiate men's basketball program of the University of Kansas.  It is one of the oldest and is one of the most successful programs in the history of basketball.  The program is classified in the NCAA's Division I and the team competes in the Big 12 Conference."}, {"title": "Billy Preston (basketball)", "paragraph": "Billy Preston (born October 26, 1997) is an American college basketball player for the Kansas Jayhawks."}, {"title": "Nova Southeastern Sharks baseball", "paragraph": "The Nova Southeastern Sharks baseball program represents Nova Southeastern University in the National Collegiate Athletic Association's NCAA Division II level.  The Sharks have a very short history, having less than thirty years of play under their belt; however, the sharks have won the Division II championship in 2016, as well as producing several MLB stars, such as J. D. Martinez of the Arizona Diamondbacks, and Mike Fiers of the Houston Astros.  They are coached by Greg Brown."}, {"title": "J. D. Martinez", "paragraph": "Julio Daniel Martinez (born August 21, 1987) is an American professional baseball right fielder for the Arizona Diamondbacks of Major League Baseball (MLB).  He previously played for the Houston Astros and Detroit Tigers.  Martinez is of Cuban descent.  He is one of 18 players in MLB history to hit four home runs in a single game."}, {"title": "Marcus Morris (basketball)", "paragraph": "Marcus David Morris (born September 2, 1989) is an American professional basketball player for the Boston Celtics of the National Basketball Association (NBA).  The 6'9' forward played college basketball at Kansas before being drafted 14th overall by the Houston Rockets in the 2011 NBA draft."}, {"title": "2011–12 Houston Rockets season", "paragraph": "The 2011–12 Houston Rockets season was the 45th season of the franchise in the National Basketball Association (NBA), and the 41st based in Houston.  The off-season saw team draft a pair of first round picks, forward Marcus Morris from Kansas was drafted 14th overall and Madrid sensation Nikola Mirotić was drafted 23rd overall.  Forward and 3-point specialist Chandler Parsons from Florida was taken with the 38th pick in the second round.  The season is most memorable when ex-Celtic Kevin McHale was hired to be their new head coach for the upcoming season.  The Rockets finished with a mediocre 34–32 record without the playoffs."}, {"title": "Oklahoma Sooners men's basketball", "paragraph": "The Oklahoma Sooners men's basketball team represents the University of Oklahoma in men's NCAA Division I basketball.  The Sooners play in the Big 12 Conference."}, {"title": "Kevin Bookout", "paragraph": "Kevin Bookout (born March 16, 1983) is an American professional basketball player.  Born in Stroud, Oklahoma, he played collegiately with the University of Oklahoma Sooners.  While with the Sooners, Bookout scored 1,018 points and pulled in 682 rebounds.  He played professionally after his senior season with the Rio Grande Valley Vipers, scoring 41 points and grabbing 41 rebounds in 9 games with the team."}, {"title": "Big East Conference (1979–2013)", "paragraph": "The Big East Conference was a collegiate athletics conference that consisted of as many as 16 universities in the eastern half of the United States from 1979 to 2013.  The conference's members participated in 24 NCAA sports.  Three members had football programs but were not Big East football schools: Notre Dame football was independent while Georgetown and Villanova competed in the Football Championship Subdivision.  Another five schools—DePaul, Marquette, Seton Hall, St. John's, and Providence—discontinued or did not have football programs."}, {"title": "2011–12 Syracuse Orange men's basketball team", "paragraph": "The 2011–12 Syracuse Orange men's basketball team represented Syracuse University in the 2011–12 NCAA Division I men's basketball season.  The head coach, Jim Boeheim, served for his 36th year.  The team played its home games at the Carrier Dome in Syracuse, New York and is a member of the Big East Conference."}, {"title": "Hamilton Wanderers AFC", "paragraph": "Hamilton Wanderers Association Football Club is a semi-professional association football club in Hamilton, New Zealand.  They compete in the Lotto Sport Italia NRFL Premier.  Notable former players include Chris Wood – (Leeds Utd, formerly of West Bromwich Albion) and Marco Rojas – ( Melbourne Victory).  They also compete in the ISPS Handa Premiership the top flight of association football in New Zealand due to WaiBop United passing their licence to compete on to them."}, {"title": "Chris Wood (footballer, born 1991)", "paragraph": "Christopher Grant Wood (born 7 December 1991) is a New Zealand professional footballer who plays as a striker for English Premier League club Burnley and the New Zealand national team, of which he is vice captain."}, {"title": "Sul América Esporte Clube", "paragraph": "Sul América Esporte Clube, commonly known as Sul América, is a Brazilian football club based in Manaus, Amazonas.  They won the Campeonato Amazonense two times and competed in the Copa do Brasil once."}, {"title": "Manaus", "paragraph": "Manaus (] ] ) or Manaós before 1939 or (formerly) Barra do Rio Negro, is the capital city of the state of Amazonas in the North Region of Brazil.  It is situated near the confluence of the Negro and Solimões rivers.  With a population of more than 2 million, it is the most populous city of both the Brazilian state of Amazonas and the Amazon rainforest."}, {"title": "Andrea Locatelli (footballer)", "paragraph": "Andrea Locatelli (born 23 September 1989) is a Swiss football forward who currently plays for FC Chiasso."}, {"title": "FC Chiasso", "paragraph": "FC Chiasso is a Swiss football club based in Chiasso.  It was founded in 1905.  Chiasso also played in the Italian first league between 1914 and 1923."}, {"title": "Gary Ayres", "paragraph": "Gary James Ayres (born 28 September 1960) is a former Australian rules footballer for the Hawthorn Football Club and currently the senior coach for the Port Melbourne Football Club in the Victorian Football League."}, {"title": "2010 Adelaide Football Club season", "paragraph": "The 2010 AFL season was the Adelaide Crows 20th season in the AFL on the back of a 5th place and a semi-final exit in the 2009 AFL season.  It was Neil Craig's 7th season at the helm after taking over from Gary Ayres as coach in 2004.  The captain for this season was Simon Goodwin and the leadership group consisted of Brad Symes, Scott Stevens, Nathan van Berlo, Ben Rutten, Michael Doughty, Brett Burton and Tyson Edwards."}, {"title": "2015 Russell Athletic Bowl", "paragraph": "The 2015 Russell Athletic Bowl was a post-season American college football bowl game played on December 29, 2015 at the Orlando Citrus Bowl in Orlando, Florida.  The 26th edition of the Russell Athletic Bowl featured the North Carolina Tar Heels of the Atlantic Coast Conference against the Baylor Bears of the Big 12 Conference.  It began at 5:30 p.m. EST and aired on ESPN.  It was one of the 2015–16 bowl games that concluded the 2015 FBS football season.  The game's naming rights sponsor was the Russell Athletic uniform company."}, {"title": "2015 Baylor Bears football team", "paragraph": "The 2015 Baylor Bears football team represented Baylor University in the 2015 NCAA Division I FBS football season.  The Bears were coached by Art Briles, playing their 117th football season; this year was the team's second season in McLane Stadium in Waco, Texas.  The Bears were members of the Big 12 Conference.  They finished the season 10–3, 6–3 in Big 12 play to finish in fourth place.  They were invited to the Russell Athletic Bowl where they defeated North Carolina 49–38."}, {"title": "NCAA Football 10", "paragraph": "NCAA Football 10 is a college football video game created by Electronic Arts.  It is the successor to NCAA Football 09 in the NCAA Football series.  It was released on July 14, 2009 for the Xbox 360, PlayStation 3, PlayStation Portable, and PlayStation 2 consoles.  Brian Johnson, Brian Orakpo, Mark Sanchez, and Michael Crabtree were the cover athletes for the game."}, {"title": "Mark Sanchez", "paragraph": "Mark Travis John Sanchez (born November 11, 1986) is an American football quarterback for the Chicago Bears of the National Football League (NFL).  He was drafted by the New York Jets in the first round of the 2009 NFL Draft as the fifth overall pick.  He played college football at the University of Southern California (USC)."}, {"title": "Bruce Grobbelaar", "paragraph": "Bruce David Grobbelaar (born 6 October 1957) is a former Zimbabwe international footballer who played as a goalkeeper, most prominently for the English team Liverpool between 1981 and 1994.  He is remembered for his gymnastic-like athletic ability, unflappable confidence and eccentric and flamboyant style of play.  He has been the goalkeeper coach for Ottawa Fury FC of the North American Soccer League since 2014."}, {"title": "1987 Football League Cup Final", "paragraph": "The 1987 Football League Cup Final was a football match played on 5 April 1987 between Arsenal and Liverpool.  The match, played in front of 96,000 spectators at Wembley Stadium, was won by Arsenal 2–1.  Ian Rush opened the scoring for Liverpool, before Charlie Nicholas equalised, turning in a cross in a crowded penalty area.  Nicholas was credited with scoring the winning goal in the second half from a Perry Groves cross.  His off-target shot deflected off Ronnie Whelan and was diverted past Liverpool goalkeeper Bruce Grobbelaar's outstretched hand."}], [{"title": "Pat Hingle", "paragraph": "Martin Patterson 'Pat' Hingle (July 19, 1924 – January 3, 2009) was an American actor who appeared in hundreds of television shows and feature films.  His first film was 'On the Waterfront' in 1954.  He often played tough authority figures.  Hingle was a close friend of Clint Eastwood and appeared in the Eastwood films 'Hang 'em High', 'The Gauntlet' and 'Sudden Impact'."}, {"title": "Clint Eastwood", "paragraph": "Clinton Eastwood Jr. (born May 31, 1930) is an American actor, filmmaker, musician, and political figure.  After achieving success in the Western TV series 'Rawhide', he rose to international fame with his role as the Man with No Name in Sergio Leone's 'Dollars' Trilogy of Spaghetti Westerns during the 1960s, and as antihero cop Harry Callahan in the five 'Dirty Harry' films throughout the 1970s and 1980s.  These roles, among others, have made Eastwood an enduring cultural icon of masculinity."}, {"title": "Lemony Snicket's A Series of Unfortunate Events", "paragraph": "Lemony Snicket's A Series of Unfortunate Events is a 2004 American dark comedy film directed by Brad Silberling.  It is a film adaptation of 'A Series of Unfortunate Events' by Lemony Snicket, covering the first three novels 'The Bad Beginning', 'The Reptile Room', and 'The Wide Window'.  The film stars Jim Carrey, Liam Aiken, Emily Browning, Timothy Spall, Catherine O'Hara, Billy Connolly, Cedric the Entertainer, Luis Guzmán, Jennifer Coolidge and Meryl Streep, as well as Jude Law as the voice of Lemony Snicket."}, {"title": "Jamie Harris (actor)", "paragraph": "Jamie Harris (born May 15, 1963) is a British actor.  He is best known for his role as The Hook-Handed Man in 'Lemony Snicket's A Series of Unfortunate Events', Rodney in 'Rise of the Planet of the Apes' and Gordon in Marvel's 'Agents of S.H.I.E.L.D.'."}, {"title": "Armageddon in Retrospect", "paragraph": "Armageddon in Retrospect is a collection of short stories and essays about war and peace written by Kurt Vonnegut.  It is the first posthumous collection of his previously unpublished writings.  The book includes an introduction by Mark Vonnegut, a letter from Kurt to his family about his experiences as an American prisoner of war in Nazi Germany, and the fire-bombing of Dresden.  Like many of Vonnegut's other books, 'Armageddon in Retrospect' is laden with handwritten quotations and rough drawings by the author."}, {"title": "Kurt Vonnegut", "paragraph": "Kurt Vonnegut Jr. ( ; November 11, 1922April 11, 2007) was an American writer.  In a career spanning over 50 years, Vonnegut published 14 novels, three short story collections, five plays, and five works of non-fiction.  He is most famous for his darkly satirical, best-selling novel 'Slaughterhouse-Five' (1969)."}, {"title": "Antonio Vivaldi", "paragraph": "Antonio Lucio Vivaldi (] ; 4 March 1678 – 28 July 1741) was an Italian Baroque composer, virtuoso violinist, teacher and cleric.  Born in Venice, he is recognized as one of the greatest Baroque composers, and his influence during his lifetime was widespread across Europe.  He composed many instrumental concertos, for the violin and a variety of other instruments, as well as sacred choral works and more than forty operas. His best-known work is a series of violin concertos known as 'The Four Seasons'."}, {"title": "Six Violin Sonatas, Op. 5 (Vivaldi)", "paragraph": "Antonio Vivaldi wrote a set of sonatas, Op. 5, in 1716."}, {"title": "Nickelback", "paragraph": "Nickelback is a Canadian rock band formed in 1995 in Hanna, Alberta, Canada.  The band is composed of guitarist and lead vocalist Chad Kroeger, guitarist, keyboardist and backing vocalist Ryan Peake, bassist Mike Kroeger, and drummer Daniel Adair.  The band went through a few drummer changes between 1995 and 2005, achieving its current lineup when Adair replaced drummer Ryan Vikedal."}, {"title": "I'd Come for You", "paragraph": "'I'd Come for You' is the second European single (fourth in Canada) from Nickelback's 2008 album 'Dark Horse'.  The song was written by the band and Mutt Lange.  It was released March 23, 2009. ' If Today Was Your Last Day' served as the third single instead in North America (after 'Gotta Be Somebody' and the rock radio-only single 'Something in Your Mouth')."}, {"title": "Suicide Kings", "paragraph": "Suicide Kings is a 1997 American mystery crime film based on Don Stanford's short story 'The Hostage' and directed by Peter O'Fallon.  It stars Christopher Walken, Denis Leary, Sean Patrick Flanery, Johnny Galecki, Jay Mohr, Jeremy Sisto and Henry Thomas.  The film follows the group of criminals who kidnap a respected Mafia figure.  It has a 34% approval rating on Rotten Tomatoes and grossed $1.7 million in the US."}, {"title": "Johnny Galecki", "paragraph": "John Mark Galecki (born April 30, 1975) is an American actor.  He is known for playing David Healy in the ABC sitcom 'Roseanne' from 1992 to 1997 and Dr. Leonard Hofstadter in the CBS sitcom 'The Big Bang Theory' since 2007.  Galecki also appeared in the films 'National Lampoon's Christmas Vacation' (1989), 'Prancer' (1989), 'Suicide Kings' (1997), 'I Know What You Did Last Summer' (1997), 'Bookies' (2003), and 'In Time' (2011)."}, {"title": "Jimmy Fallon", "paragraph": "James Thomas Fallon (born September 19, 1974) is an American comedian, actor, television host, and musician.  He is known for his work in television as a cast member on 'Saturday Night Live' and as the host of late-night talk show 'The Tonight Show Starring Jimmy Fallon'.  He was born in Bay Ridge, Brooklyn and raised in Saugerties, New York.  He grew up with an interest in comedy and music, moving to Los Angeles at 21 to pursue stand-up opportunities."}, {"title": "Ew!", "paragraph": "'Ew!'  is a song by American television host and comedian Jimmy Fallon, featuring American rapper will.i.am.  The song is based on a sketch from 'The Tonight Show Starring Jimmy Fallon', in which Fallon and guests play teenage girls constantly disgusted by things around them."}, {"title": "The Saturdays", "paragraph": "The Saturdays was a British-Irish girl group based in London, England.  The group formed during the summer of 2007.  The line up consisted of Frankie Bridge, Una Healy, Rochelle Humes, Mollie King and Vanessa White.  They were formed through Fascination Records, who gave them an instant record deal with the label as well as a sub-division of Polydor Records.  As soon as the contract was finalised The Saturdays went on tour with Girls Aloud during their Tangled Up Tour.  The group's music style is pop, however throughout their career their management have experimented with dance-pop and electropop.  To create this music, Ina Wroldsen, Steve Mac and Quiz & Larossi have been heavily involved."}, {"title": "The Voice of Ireland (series 4)", "paragraph": "The Voice of Ireland is an Irish reality talent show.  The fourth series of the programme premiered on 4 January 2015 on RTÉ One and concluded on 26 April, similar to previous seasons.  Kathryn Thomas returned as main host, while her colleague Eoghan McDermott remained the show's co-host.  Television personalities Bressie and Kian Egan both returned as coaches, while The Saturdays singer Una Healy and S Club 7 star Rachel Stevens filled the remaining two positions.  Screentime Shinawil Productions continued to produce the talent programme."}, {"title": "Rock Springs (short story collection)", "paragraph": "Rock Springs is a collection of short stories by author Richard Ford, published in 1987 and largely dealing with dysfunctional mothers and fathers and their effects on young male narrators."}, {"title": "Richard Ford", "paragraph": "Richard Ford (born February 16, 1944) is an American novelist and short story writer.  His best-known works are the novel 'The Sportswriter' and its sequels, 'Independence Day', 'The Lay of the Land' and 'Let Me Be Frank With You', and the short story collection 'Rock Springs', which contains several widely anthologized stories."}, {"title": "Mamie Gummer", "paragraph": "Mary Willa 'Mamie' Gummer (born August 3, 1983) is an American actress.  She starred in the title role of The CW series 'Emily Owens, M.D.' (2012–13), and played the recurring role of Nancy Crozier on 'The Good Wife' (2010–15).  She has also appeared in the films 'Evening' (2007), 'Side Effects' (2013), 'Cake' (2014), and 'Ricki and the Flash' (2015).  She was nominated for the 2016 Drama Desk Award for Outstanding Actress in a Play for the original production of 'Ugly Lies the Bone'."}, {"title": "The Good Wife", "paragraph": "The Good Wife is an American legal and political drama television series that aired on CBS from September 22, 2009, to May 8, 2016.  The series focuses on Alicia Florrick, the wife of the Cook County State's Attorney, who returns to her career in law after the events of a public sex and political corruption scandal involving her husband.  The series, created by Robert and Michelle King, stars Julianna Margulies, Josh Charles, Christine Baranski, Matt Czuchry, Archie Panjabi, and Alan Cumming, and features Chris Noth in a recurring role.  The executive producers are Ridley Scott, Charles McDougall, and David W. Zucker.  'The Good Wife' is a heavily serialized show featuring several story arcs that carry over several episodes, as well as stand-alone procedural storylines that are concluded by the end of each episode.  The serial plots have been especially showcased in its highly praised fifth season.  This is a rarity among 'The Good Wife'' s broadcaster CBS, as most of its shows are procedural."}, {"title": "What Lovers Do", "paragraph": "'What Lovers Do' is a song by American pop rock band Maroon 5 featuring American R&B singer Sza.  It was released on August 30, 2017, as the third single from the band's upcoming sixth studio album (2017).  The song contains an interpolation of the 2016 song 'Sexual' by Neiked featuring Dyo, therefore Victor Rådström, Dyo and Elina Stridh are credited as songwriters."}, {"title": "Maroon 5", "paragraph": "Maroon 5 is an American pop rock band that originated in Los Angeles, California.  It currently consists of lead vocalist Adam Levine, keyboardist and rhythm guitarist Jesse Carmichael, bassist Mickey Madden, lead guitarist James Valentine, drummer Matt Flynn and keyboardist PJ Morton."}, {"title": "Happy Death Day", "paragraph": "Happy Death Day is an upcoming American slasher film directed by Christopher B. Landon and written by Scott Lobdell.  It stars Jessica Rothe and Israel Broussard.  The film was produced by Jason Blum through his Blumhouse Productions banner."}, {"title": "Jessica Rothe", "paragraph": "Jessica Rothe (born Jessica Rothenberg, May 28, 1987) is an American actress.  She stars in the upcoming 2017 film 'Happy Death Day'.  She appeared in 2016's 'La La Land', ."}, {"title": "Small Town Boy (song)", "paragraph": "'Small Town Boy' is a song recorded by American country music artist Dustin Lynch.  It was released to country radio on February 17, 2017 as the second single from his third studio album, 'Current Mood'."}, {"title": "Current Mood", "paragraph": "Current Mood is the third studio album by American country music singer Dustin Lynch.  It was released on September 8, 2017, via Broken Bow Records.  The album includes the singles 'Seein' Red' and 'Small Town Boy', which have both reached number one on the Country Airplay chart."}, {"title": "Vanessa Bley", "paragraph": "Vanessa Bley is a New York City and Los Angeles–based singer, composer, producer, and musician.  She is daughter of jazz pianist Paul Bley and pioneer video artist Carol Goss."}, {"title": "Impresario", "paragraph": "An impresario (from the Italian 'impresa', 'an enterprise or undertaking') is a person who organizes and often finances concerts, plays, or operas, performing a role similar to that of an artist manager or a film or television producer.  The term originated in the social and economic world of Italian opera, in which from the mid-18th century to the 1830s, the impresario was the key figure in the organization of a lyric season.  The owners of the theatre, usually noble amateurs, charged the impresario with hiring a composer (until the 1850s operas were expected to be new) and the orchestra, singers, costumes and sets, all while assuming considerable financial risk.  In 1786 Mozart satirized the stress and emotional mayhem in a single-act farce 'Der Schauspieldirektor' ('The Impresario').  Antonio Vivaldi was unusual in acting as both impresario and composer; in 1714 he managed seasons at Teatro San Angelo in Venice, where his opera 'Orlando finto pazzo' was followed by numerous others."}, {"title": "Mom (film)", "paragraph": "Mom is a 2017 Indian thriller film directed by Ravi Udyawar.  Produced by Boney Kapoor, Sunil Manchanda, Mukesh Talreja, Naresh Agarwal and Gautam Jain, the film stars Sridevi, as a vigilante, who sets out to avenge her daughter, played by Sajal Ali.  Adnan Siddiqui.  Akshaye Khanna and Nawazuddin Siddiqui play supporting roles in the film.  Music for the film has been produced by A. R. Rahman.  The film was released on 7 July 2017, in four languages, and received positive reviews from film critics.  It was successful commercially as well.  'Mom' marked Sridevi's 300th film appearance."}, {"title": "Shashaa Tirupati", "paragraph": "Shashaa Tirupati is a playback singer, songwriter and voice over artist of Indo-Canadian origin, with family roots in Kashmir, predominantly active in the Bollywood and South Indian music industries.  She is the voice behind Bollywood hits such as: 'The Humma Song' (OK Jaanu), 'Phir Bhi Tumko Chahunga' (with Arijit Singh) (Half Girlfriend), 'Baarish' (Half Girlfriend), 'Kanha' (Shubh Mangal Saavdhan), 'O Sona Tere Liye' (with A.R. Rahman) and 'Chal Kahin Door', both from the Sridevi starrer MOM."}], [{"title": "Kalākaua", "paragraph": "Kalākaua (November 16, 1836 – January 20, 1891), born David Laʻ amea Kamananakapu Mahinulani Naloiaehuokalani Lumialani Kalākaua and sometimes called The Merrie Monarch, was the last king (and second to last monarch) of the Kingdom of Hawaiʻ i.  He reigned from February 12, 1874 until his death in San Francisco, California, on January 20, 1891.  Kalākaua had a convivial personality and enjoyed entertaining guests with his singing and ukulele playing.  At his coronation and his birthday jubilee, the hula that had been banned from public in the kingdom became a celebration of Hawaiian culture."}, {"title": "Charles Hastings Judd", "paragraph": "Colonel Charles Hastings Judd (September 8, 1835 – April 18, 1890) was an American businessman, rancher, courtier and politician of the Kingdom of Hawaii.  He served as Chamberlain and Colonel of the military staff of King Kalākaua and traveled with the monarch on his 1881 world tour."}, {"title": "Sasanian Empire", "paragraph": "The Sasanian Empire ( or ), also known as the Sassanian, Sasanid, Sassanid or Neo-Persian Empire, known to its inhabitants as Ērānshahr in Middle Persian, was the last period of the Persian Empire (Iran) before the rise of Islam, named after the House of Sasan who ruled from 224 to 651 AD.  The Sasanian Empire, which succeeded the Parthian Empire, was recognised as one of the leading world powers alongside its neighbouring arch-rival the Roman-Byzantine Empire, for a period of more than 400 years."}, {"title": "Farrukhzad Khosrow V", "paragraph": "Farrukhzad Khosrau V was briefly king of the Sasanian Empire from March 631 to April 631.  He was the son of Khosrau II."}, {"title": "Salisbury Woodland Gardens, Blackpool", "paragraph": "Salisbury Woodland Gardens is an open space located in the east of Blackpool, flanked by East Park Drive and Woodside Drive and linking Blackpool Zoo with Stanley Park.  Known simply as the 'Woodland Gardens' to local people, the site was acquired in 1924 by Blackpool Corporation and was originally developed as a shelter belt for the adjacent Stanley Park Golf Course.  The gardens were later developed in the 1940s as an arboretum and public open space for all to enjoy.  It was renovated in 1967 by Peter Perry and his 'Flying Squad (see below).  Popular once as a wedding photograph location, the site went into decline during the 1990s.  The Council's Ranger Service manage and protect the gardens which they took over in September 2006 and have been funding and undertaking the restoration of the woodland."}, {"title": "Stanley Park, Blackpool", "paragraph": "Stanley Park is a public park in the town of Blackpool on the Fylde coast in Lancashire, England.  It is the town's primary park and covers an area of approximately 104 ha .  The park was designed to include significant sporting provisions, along with formal gardens, a boating lake and woodland area.  It was designed and built in the 1920s, under the eye of Thomas Mawson."}, {"title": "Music City Queen", "paragraph": "Music City Queen was a replica showboat formerly operating for entertainment purposes on the Cumberland River in the southern United States.  It was the smaller of two stern-wheel paddle steamers based at Opry Mills in Nashville, Tennessee; the other is the 'General Jackson'."}, {"title": "Opry Mills", "paragraph": "Opry Mills is a super-regional shopping mall owned by Simon Property Group, formerly by its initial owners Mills Corporation and Gaylord Entertainment.  It opened in Nashville, Tennessee in 2000 on the former site of the Opryland USA theme park."}, {"title": "USS Essex (CV-9)", "paragraph": "USS 'Essex' (CV/CVA/CVS-9) was an aircraft carrier and the lead ship of the 24-ship 'Essex' class built for the United States Navy during World War II.  She was the fourth US Navy ship to bear the name.  Commissioned in December 1942, 'Essex' participated in several campaigns in the Pacific Theater of Operations, earning the Presidential Unit Citation and 13 battle stars.  Decommissioned shortly after the end of the war, she was modernized and recommissioned in the early 1950s as an attack carrier (CVA), and then eventually became an antisubmarine aircraft carrier (CVS).  In her second career, she served mainly in the Atlantic, playing a role in the Cuban Missile Crisis.  She also participated in the Korean War, earning four battle stars and the Navy Unit Commendation.  She was the primary recovery carrier for the Apollo 7 space mission."}, {"title": "VMF-213", "paragraph": "Marine Fighting Squadron 213 (VMF-213) was a reserve fighter squadron in the United States Marine Corps.  Nicknamed the 'Hell Hawks', the squadron fought during World War II in the Philippines and at the battles of Iwo Jima and Okinawa.  With its assignment to the USS Essex (CV-9) and 'Air Group 4', VMF-213 along with VMF-124 was one of the first two Marine squadrons to augment carrier air groups during World War II.  The squadron was credited with downing 117 enemy aircraft during the war."}, {"title": "Northumbrian dialect", "paragraph": "Northumbrian was a dialect of Old English spoken in the Anglian Kingdom of Northumbria.  Together with Mercian, Kentish and West Saxon, it forms one of the sub-categories of Old English devised and employed by modern scholars."}, {"title": "Kingdom of Northumbria", "paragraph": "The Kingdom of Northumbria ( ; Old English: 'Norþhymbra rīce' , 'kingdom of the Northumbrians') was a medieval Anglian kingdom in what is now northern England and south-east Scotland, which subsequently became an earldom in a unified English kingdom.  The name reflects the approximate southern limit to the kingdom's territory, the Humber estuary."}, {"title": "Lake Louisvilla, Louisville", "paragraph": "Lake Louisvilla is a neighborhood partially located in Louisville, Kentucky.  It is located between Westport Road in Louisville and KY 22 in Oldham County.  Lake Louisvilla was developed in the 1920s as a summer resort for people living in the city of Louisville.  The state of Kentucky drained the lake in the late 1980s due to safety concerns regarding the stability of a dam."}, {"title": "Oldham County, Kentucky", "paragraph": "Oldham County is a county located in the commonwealth of Kentucky.  As of the 2010 census, the population was 60,316.  Its county seat is La Grange.  The county is named for Colonel William Oldham.  Oldham County was a prohibition or completely dry county until January 2005 as the result of a 2004 'moist' vote, permitting sales of alcohol in restaurants that seat at least 100 patrons in which 70%+ of total revenue is derived from sales of food.  After a vote in late 2015; Oldham county has become a completely wet county."}, {"title": "Charles Deaton", "paragraph": "Charles Utter Deaton (January 1, 1921 – December 18, 1996) was an American architect.  He designed several athletic stadiums, and is noted for his futuristic Sculptured House that was featured in the 1973 film 'Sleeper'.  He is also noted as the designer of Kansas City's Arrowhead Stadium and Kauffman Stadium."}, {"title": "Arrowhead Stadium", "paragraph": "Arrowhead Stadium is a football stadium in Kansas City, Missouri, United States, that primarily serves as the home venue of the Kansas City Chiefs of the National Football League (NFL).  It is part of the Truman Sports Complex with adjacent Kauffman Stadium, the home of the Kansas City Royals of Major League Baseball (MLB).  Arrowhead has a seating capacity of 76,416, making it the 28th largest stadium in North America and sixth largest NFL stadium.  It is also the largest sports facility by capacity in the state of Missouri.  A $375 million renovation was completed in 2010."}, {"title": "Worcester, Massachusetts", "paragraph": "Worcester ( , ] ) is a city and the county seat of Worcester County, Massachusetts, United States.  Named after Worcester, England, as of the 2010 Census the city's population was 181,045, making it the second most populous city in New England after Boston.  Worcester is located approximately 40 mi west of Boston, 50 mi east of Springfield and 40 mi north of Providence.  Due to its location in Central Massachusetts, Worcester is known as the 'Heart of the Commonwealth', thus, a heart is the official symbol of the city.  However, the heart symbol may also have its provenance in lore that the mass-produced Valentine's Day card was invented in the city."}, {"title": "Bartlett's Bridge", "paragraph": "Bartlett's Bridge is a historic stone arch bridge carrying Clara Barton Road over the French River in Oxford, Massachusetts.  The bridge was built in 1889 to a design by Charles A. Allen, at the time a civil engineer for the city of Worcester.  The bridge was built to replace an older wooden span at the request of Edwin Bartlett, the owner of textile mills in North Oxford, whose businesses and employees would have used the road.  The bridge is 30 ft long and 42 ft wide, with its elliptical arch reaching a height of 13 ft above the river.  The facing of the bridge is rough-cut granite that has been fixed with mortar.  In contrast, the granite stones that make up the arch have been very precisely worked.  The bridge has parapet walls made of large granite slabs 4.5 ft , 2 ft wide, and 1 ft thick."}, {"title": "Waterloo Vase", "paragraph": "The Waterloo Vase is a great urn, 15ft (5m) high and weighing 20 tons, fashioned from a single piece of Carrara marble.  Since 1906, it has been used as a garden ornament in the garden of Buckingham Palace, London."}, {"title": "Buckingham Palace", "paragraph": "Buckingham Palace ( ) is the London residence and administrative headquarters of the reigning monarch of the United Kingdom.  Located in the City of Westminster, the palace is often at the centre of state occasions and royal hospitality.  It has been a focal point for the British people at times of national rejoicing and mourning."}, {"title": "Eric A. Sykes", "paragraph": "Eric Anthony Sykes (5 February 1883–12 May 1945), born Eric Anthony Schwabe in Barton-upon-Irwell, Eccles, Greater Manchester, England, was a soldier and firearms expert.  He is most famous for his work with William E. Fairbairn in the development of the eponymous Fairbairn-Sykes Fighting Knife and modern British Close Quarters Battle (CQB) martial arts during World War II.  Originally working for an import/export company selling weapons in East Asia, he claimed he volunteered for and served in the British Army as a sharpshooter on the Western Front during World War I.  Returning to China in 1917, he joined the volunteer branch of the Shanghai Municipal Police (SMP) Specials with the rank of Inspector in 1926."}, {"title": "Eccles, Greater Manchester", "paragraph": "Eccles (/ˈɛkəlz/; pop.  38,756 (2011)) is a town in Greater Manchester, England, 2.7 mi west of Salford and 3.7 mi west of Manchester city centre, between the M602 motorway to the north and the Manchester Ship Canal to the south."}, {"title": "Eighth Wonder of the World", "paragraph": "Eighth Wonder of the World is an unofficial title sometimes given to new buildings, structures, projects, or even designs that are deemed to be comparable to the seven Wonders of the World."}, {"title": "Astrodome", "paragraph": "The NRG Astrodome, also known as the Houston Astrodome or simply The Astrodome, is the world's first multi-purpose, domed sports stadium, located in Houston, Texas.  Construction on the stadium began in 1962, and it officially opened in 1965.  It served as home to the Houston Astros of Major League Baseball (MLB) from its opening in 1965 until 1999, and the home to the Houston Oilers of the National Football League (NFL) from 1968 until 1996, and also the part-time home of the Houston Rockets of the National Basketball Association (NBA) from 1971 until 1975.  Additionally, the Astrodome was the primary venue of the Houston Livestock Show and Rodeo from 1966 until 2002.  When opened, it was named the Harris County Domed Stadium and was nicknamed the 'Eighth Wonder of the World'."}, {"title": "History of the United States Republican Party", "paragraph": "The Republican Party, also commonly called the GOP (for 'Grand Old Party'), is one of the world's oldest extant political parties.  It is the second oldest existing political party in the United States after its primary rival, the Democratic Party.  It emerged in 1854 to combat the Kansas–Nebraska Act, an act that dissolved the terms of the Missouri Compromise and allowed slave or free status to be decided in the territories by popular sovereignty.  The Party had almost no presence in the Southern United States, but by 1858 in the North it had enlisted former Whigs and former Free Soil Democrats to form majorities in nearly every Northern state."}, {"title": "Kansas–Nebraska Act", "paragraph": "The Kansas–Nebraska Act of 1854 (10 Stat.  277 ) created the territories of Kansas and Nebraska and was drafted by Democratic Senator Stephen A. Douglas of Illinois and President Franklin Pierce.  The initial purpose of the Kansas–Nebraska Act was to open up thousands of new farms and make feasible a Midwestern Transcontinental Railroad.  The popular sovereignty clause of the law led pro- and anti-slavery elements to flood into Kansas with the goal of voting slavery up or down, resulting in Bleeding Kansas."}, {"title": "Cartoon Network", "paragraph": "Cartoon Network is an American basic cable and satellite television channel that is owned by The Cartoon Network, Inc., a subsidiary of Turner Broadcasting System, itself being a subsidiary of Time Warner.  It was founded by Betty Cohen and launched on October 1, 1992."}, {"title": "The Greatest Event in Television History", "paragraph": "The Greatest Event in Television History is a mockumentary television series created by Adam Scott and Naomi Sablan.  The series premiered on Cartoon Network's late night programming block Adult Swim on October 12, 2012 and ended on January 23, 2014 with a total of four episodes.  Each episode originally aired independently as a special presentation, several months apart."}, {"title": "History of California before 1900", "paragraph": "Human history in California begins with indigenous Americans first arriving in California some 13,000–15,000 years ago.  Exploration and settlement by Europeans along the coasts and in the inland valleys began in the 16th century.  California was acquired by the United States under the terms of the 1848 Treaty of Guadalupe Hidalgo following the defeat of Mexico in the Mexican–American War.  American westward expansion intensified with the California Gold Rush, beginning in 1849.  California joined the Union as a free state in 1850, due to the Compromise of 1850.  By the end of the 19th century, California was still largely rural and agricultural, but had a population of about 1.4 million."}, {"title": "Compromise of 1850", "paragraph": "The Compromise of 1850 was a package of five separate bills passed by the United States Congress in September 1850, which defused a four-year political confrontation between slave and free states on the status of territories acquired during the Mexican–American War (1846–1848).  The compromise, drafted by Whig Senator Henry Clay of Kentucky and brokered by Clay and Democratic Senator Stephen Douglas of Illinois, reduced sectional conflict.  Controversy arose over the Fugitive Slave provision.  The Compromise was greeted with relief, but each side disliked some of its specific provisions:"}]], "titles": [["Winner (band)", "2014 S/S", "List of awards and nominations received by Shinee", "Cho Kyuhyun", "History (band)", "Madtown", "List of songs written by Ravi", "SF9 (band)", "Seventeen discography", "BTS discography"], ["Management consulting", "Eenasul Fateh", "James P. Comer", "Method Man", "Indriati Iskak", "Mick (DJ)", "Criss Angel", "ELDee", "Lil Ru", "Amaruk Kayshapanta"], ["Brown County, Kansas", "Brown State Fishing Lake", "Fishing Lake", "Osage State Fishing Lake", "Neosho State Fishing Lake", "Narrow Hills Provincial Park", "Shawnee State Fishing Lake", "Higgins Lake, Michigan", "Higgins Lake", "Commanda Lake"], ["Henry J. Kaiser", "Kaiser Ventures", "Edgar Kaiser Jr.", "Nutri Ventures – The Quest for the 7 Kingdoms", "Eagle Mountain Railroad", "Neafie &amp; Levy", "Kaiser Shipyards", "John Roach &amp; Sons", "New York Shipbuilding Corporation", "Edgar Kaiser Sr."], ["International Boxing Federation", "Vince Phillips", "Ralph Charles", "Bunny Grant", "Andrew Murray (Guyanese boxer)", "Fatai Onikeke", "Julian Holland (boxer)", "Jeff Malcolm", "Zab Judah", "Lawrence Austin"], ["Oranjegekte", "Koningsdag", "Queen's Day (disambiguation)", "Children's Day (Japan)", "Garifuna Settlement Day", "Jounen Kwéyòl", "The Eighth (United States)", "Saint-Jean-Baptiste Day", "White Sunday", "Christmas in the Basque Country"], ["Bobbi Bacha", "Sela Ward", "Barend", "Marion Christopher Barry", "Suburban Madness", "Latvian name", "Singh", "Jeff Strabone", "Chris Funk", "Middle name"], ["1925 Birthday Honours", "George V", "2017 Birthday Honours", "2014 Birthday Honours", "2015 Birthday Honours", "2016 Birthday Honours", "Birthday Honours", "1965 Birthday Honours", "1951 Birthday Honours", "2013 Birthday Honours"], ["Lourenço Mutarelli", "Crime and Punishment", "The Golden Hour (novel)", "Quando Eu Era Vivo", "Spirit of the Border", "Before We Say Goodbye", "4 a.m. (novel)", "Three Comrades (novel)", "Drained", "The Birds on the Trees"], ["Viglen", "Bordan Tkachuk", "Cardinal Health", "Terren Peizer", "BankUnited", "Compass Minerals", "Owens &amp; Minor", "Kingstone Companies", "Jonathan Michael Ansell", "Clean Power Finance"], ["George Raft", "Johnny Angel", "Johnny Angel Wendell", "Shelley Fabares", "Cool from the Wire", "William D. Russell (director)", "Johnny Lee Clary", "Gösta Prüzelius", "Johnny Angel (song)", "Claudia Drake"], ["2000 ICC KnockOut Trophy", "Zaheer Khan", "1998 ICC KnockOut Trophy Final", "2000 ICC KnockOut Trophy squads", "Lindum Sports Club Ground", "Guy Randall-Johnson", "1998 ICC KnockOut Trophy squads", "Sam Davies (cricketer)", "Peter Kingston-Davey", "Digswell Park"], ["Caroline Carver (actress)", "The Magical Legend of the Leprechauns", "Donald J. Hall Jr.", "Silver Bells (film)", "La Femme Musketeer", "The Boys Next Door (1996 film)", "Snow White: The Fairest of Them All", "You Me and Captain Longbridge", "Snow Queen (2002 film)", "Family Plan"], ["Gum Wall", "San Luis Obispo, California", "Old US 67 Rest Area", "Philadelphia Baseball Wall of Fame", "Ouch! (gum)", "Hollywood Star Lanes", "Digital Media Factory", "Up Your Alley Fair", "Lower Louviers and Chicken Alley", "Bubblegum Alley"], ["Jillian Bell", "SuperMansion", "Helen Modern", "Mitch Pileggi", "John Amos", "Hilarie Burton", "Jo Marie Payton", "Jenna Dewan", "John Pappas", "Jeff Hephner"], ["Reading Post", "Maiwand Lion", "Dras War Memorial", "Devon County War Memorial", "Manchester Cenotaph", "York City War Memorial", "Spalding War Memorial", "The Forbury Hotel", "St James's Church, Reading", "Forbury Gardens"], ["2014 FIFA World Cup", "Algeria at the FIFA World Cup", "2015 Cricket World Cup opening ceremony", "Orvar Bergmark", "2002 FIFA World Cup", "1991 Rugby World Cup", "Ukraine national football team", "1968–69 in Belgian football", "Tertiary Student Rugby League World Cup", "Switzerland women's national football team"], ["Kelly Osbourne", "2014 Young Hollywood Awards", "2013 Young Hollywood Awards", "Jeremy Schoenberg", "12th Youth in Film Awards", "2003 Kids' Choice Awards", "Maureen Dragone", "Penske Media Corporation", "Puerto Roc Records", "Young Hollywood Awards"], ["New York's 1st State Senate district", "Kenneth LaValle", "New York's 2nd State Senate district", "Nesting (voting districts)", "California State Senate", "New York's 3rd State Senate district", "Steven Bradford", "Andrea Stewart-Cousins", "Hawaii Senate", "New York's 4th State Senate district"], ["Tefik Mborja", "Albanian Fascist Party", "Swedish general election, 1982", "Bal'arab bin Himyar", "Confederation of Mexican Workers", "United Bermuda Party", "Australian federal election, 1972", "People's Socialist Republic of Albania", "Madras Legislative Assembly election, 1967", "Hungarian Communist Party"]], "contextss": [["Winner (Hangul: 위너), often stylized as WINNER, is a South Korean boy group formed in 2013 by YG Entertainment and debuted in 2014.  It currently consists of four members, Jinwoo, Seunghoon, Mino and Seungyoon.  Originally a five-piece group with Taehyun, who later departed from the group in November 2016.", "2014 S/S is the debut album of South Korean group WINNER.  It was released on August 12, 2014 by the group's record label, YG Entertainment.  The members were credited for writing the lyrics and composing the majority of the album's songs.", "South Korean boy group Shinee have received several awards and nominations for their music work.  The group was formed by S.M. Entertainment in 2008 and released their first full-length album, 'The Shinee World', on August 28, 2008, which won the Newcomer Album of the Year at the 23rd Golden Disk Awards.  The first single released from the album was 'Sanso Gateun Neo (Love Like Oxygen)' and won first place on 'M Countdown' on September 18, 2008 making it the group's first win on Korean music shows since debut.  Their second album 'Lucifer' (2010) produced two singles, 'Lucifer' and 'Hello'.  For their outstanding choreography the group was nominated for the Best Dance Performance Award at the Mnet Asian Music Awards in 2010. ' Lucifer' also won the Disk Bonsang Award at the 25th Golden Disk Awards as well as the Popularity Award.  On March 21, 2012 the group released their fourth EP 'Sherlock' for which the group was awarded another Disk Bonsang Award at the 27th Golden Disc Awards and the Bonsang Award at the 22nd Seoul Music Award.  Also following the success of the lead single it was also nominated for Song of the Year at the 2012 Mnet Asian Music Awards.", "Cho Kyu-hyun (born February 3, 1988), better known mononymously as Kyuhyun, is a South Korean singer and musical theatre actor.  He is best known as a member of South Korean boy group Super Junior, its sub-groups Super Junior-K.R.Y., Super Junior-M and a former member of the South Korean ballad group S.M. the Ballad.  He is one of the first four Korean artists to appear on Chinese postage stamps.", "History (Korean: 히스토리 ) was a South Korean boy group formed by LOEN Entertainment in 2013.  They debuted on April 26, 2013 with 'Dreamer', featuring the narration of their labelmate IU.  They were LOEN Entertainment's first boy group.  They officially disbanded on May 12, 2017.", "Madtown (Hangul: 매드타운 ), often stylized as MADTOWN, is a South Korean boy group formed in 2014 by J. Tune Camp.  The group consists of Moos, Daewon, Lee Geon, Jota, Heo Jun, Buffy and H.O.  Their debut album, 'Mad Town', was released on October 6, 2014.  Two of the members, Moos and Buffy, originally debuted as the hip hop duo 'Pro C' in 2013.  Madtown's official fan-base name is Mad-people.  Starting December 22, 2016, MADTOWN's contract was sold to GNI Entertainment after J. Tune Camp closed.", "Ravi is a South Korean rapper, songwriter and producer, signed under Jellyfish Entertainment.  He began his career as a rapper in 2012 in the South Korean boy group VIXX, and later formed VIXX's first sub-unit VIXX LR with band mate Leo in 2015.  Ravi's songwriting career began with his participation in co-writing VIXX's debut single 'Super Hero'.  As of November 2016 with the release of 'VIXX 2016 Conception Ker', Ravi has contributed to the writing and composing of over 46 songs recorded by VIXX.  Ravi is widely known for his participation of composing and songwriting rap portions for the group as well as lyrics and music.", "SF9 (Korean: 에스에프나인 ; shortened from Sensational Feeling 9) is a South Korean boy group formed by FNC Entertainment.  SF9 is the company's first dance boy group to ever debut.  SF9 debuted on October 5, 2016 with the release of their first single album 'Feeling Sensation'.", "This is the discography of South Korean boy group Seventeen.  Seventeen (Hangul: 세븐틴), also stylized as SEVENTEEN or SVT, is a South Korean boy group formed by Pledis Entertainment in 2015.  They have released one album and four EPs.", "The following is the discography of South Korean boy group BTS.  The group debuted in South Korea on June 2013 with single album, '2 Cool 4 Skool', at number 5 on South Korean Week 31 Gaon Weekly Chart.  They made a comeback on September 2013 with an extended play, 'O!RUL8,2? ', which peaked at number 4 on Week 38 Gaon Weekly Chart.  BTS then released their second extended play, 'Skool Luv Affair', in February 2014, where it charted at number 1 on Week 18 Gaon Weekly Chart.  This also marked the first time their album charted on international charts, Billboard World Albums and Japan's Oricon Chart, specifically.  A repackaged version of the album, 'Skool Luv Affair Special Addition' which was released in May 2014, also peaked at number 1 on Week 21 Gaon Weekly Chart."], ["Management consulting is the practice of helping organizations to improve their performance, operating primarily through the analysis of existing organizational problems and the development of plans for improvement.  Organizations may draw upon the services of management consultants for a number of reasons, including gaining external (and presumably objective) advice and access to the consultants' specialized expertise.", "Eenasul Fateh (Bengali: ঈনাসুল ফাতেহ ; born 3 April 1959), also known by his stage name Aladin, is a Bangladeshi-British cultural practitioner, magician, live artist and former international management consultant.", "James P. Comer (born James Pierpont Comer, September 25, 1934 in East Chicago, Indiana) is currently the Maurice Falk Professor of Child Psychiatry at the Yale Child Study Center and has been since 1976.  He is also an associate dean at the Yale School of Medicine.  As one of the world's leading child psychiatrists, he is best known for his efforts to improve the scholastic performance of children from lower-income and minority backgrounds which led to the founding of the Comer School Development Program in 1968.  His program has been used in more than 600 schools in eighty-two school districts.  He is the author of ten books, including the autobiographical 'Maggie’s American Dream: The Life and Times of a Black Family', 1988; 'Leave No Child Behind: Preparing Today's Youth for Tomorrow's World', 2004; and his most recent book, 'What I Learned in School: Reflections on Race, Child Development, and School Reform', 2009.  He has also written more than 150 articles for Parents (magazine) and more than 300 articles on children's health and development and race relations.  Dr. Comer has also served as a consultant to the Children's Television Workshop (Sesame Workshop) which produces Sesame Street and The Electric Company (1971 TV series).  He is a co-founder and past president of the Black Psychiatrists of America and has served on the board of several universities, foundations, and corporations.  He has also lectured and consulted widely not only across the United States at different universities, medical schools, and scientific associations, but also around the world in places such as London, Paris, Tokyo, Dakar, Senegal and Sydney, Australia.  For his work and scholarship, Dr. Comer has been awarded 47 honorary degrees and has been recognized by numerous organizations.", "Clifford Smith (born April 1, 1971), better known by his stage name Method Man, is an American rapper, record producer, and actor.  He is known as a member of the East Coast hip hop collective Wu-Tang Clan.  He is also one half of the hip hop duo Method Man & Redman.  He took his stage name from the 1979 film 'Method Man'.  In 1996, he won a Grammy Award for Best Rap Performance by a Duo or Group, for 'I'll Be There for You/You're All I Need to Get By', with American R&B singer-songwriter Mary J. Blige.", "Indriati Gerald Bernardina (born 9 June 1942), also known by her stage name Indriati Iskak and after marriage as Indri Makki, is an Indonesian actress turned psychologist and marketer.  Born in Surabaya, she entered the Indonesian film industry and soared to popularity with Usmar Ismail's commercially successful 'Tiga Dara' (1957).  She appeared in eight further films and established her own girl group before retiring from cinema in 1963.  She graduated from the University of Indonesia with a degree in psychology in 1968, and has taught the subject at the .  For twenty-six years she worked with Unilever, and since 1994 she has been a marketing consultant with Makki Makki.", "Mick Batyske (known by his stage name Mick, sometimes styled as MICK, and formerly Mick Boogie) is an American DJ and entrepreneur.  He is an A-list DJ and spun private parties for celebrities including Kanye West, LeBron James, Jay-Z and Will Smith.  In addition to his mix tape releases, he has performed in venues internationally, including New York City, Dubai, Tokyo, Las Vegas, and Los Angeles.  As an entrepreneur, he has invested in various start-up companies including Localeur, in which he is also an advisor and consultant.", "Christopher Nicholas Sarantakos (born December 19, 1967), known by the stage name Criss Angel, is an American magician, illusionist and musician.  Angel began his career in New York City, before moving his base of operations to the Las Vegas Valley.  He is known for starring in the television and stage show 'Criss Angel Mindfreak' and his previous live performance illusion show 'Criss Angel Believe' in collaboration with 'Cirque du Soleil' at the Luxor casino in Las Vegas.  The show generated $150 million in tourist revenue to Las Vegas in 2010, but has since been replaced by 'Mindfreak LIVE' on 11 May 2016 (the show is partly produced by Cirque, however the directive rights are entirely with Criss Angel).  He also starred in the television series 'Criss Angel BeLIEve' on Spike TV, the reality-competition television show 'Phenomenon' on NBC, and the 2014 stage show 'Criss Angel Magicjam'.", "Lanre Dabiri (born May 23, 1977), better known by his stage name Eldee, stylized as eLDee, is a former Nigerian-American rapper, singer, and record producer but now an IT Consultant based in the United_States 'Lanre' is a diminutive for the Yoruba name 'Olanrewaju' (which translates to ''Wealth is moving forward'').  eLDee has a masters degree in Architecture from the University of Lagos, Nigeria.  He is an original member of the band Trybesmen, which was started in 1998 with rappers KB and Freestyle.  He hails from Lagos Island in Lagos State of Nigeria.", "Sylvester Samuels better known by his stage name Lil Ru, is an American rapper from Ridgeway, South Carolina currently signed to Def Jam Recordings.  His debut album, 21 & Up was released on August 25, 2009.  The Ridgeway native was 16 when he made his professional foray into the music business.  Inspired by New Orleans’ innovative Cash Money Crew, Ru began making a name for himself on his local music scene, doing live shows and pressing up his own CDs.  His hard-hitting lyrics and entrepreneurial spirit caught the attention of fellow South Carolinian Angie Stone.  Shortly after the neo-soul songstress helped him secure a deal with Elektra Records, Ru found himself unsigned again, among the artists lost in the shuffle after the label merged with Atlantic Records.  Music fans first heard him on his 2001 debut single Will Destroy.  He then released his 2002 follow up, Shawty What You Doin’.  Both songs reached the Billboard R&B/Hip-Hop charts and helped land him at his next label home, Capitol Records.", "Amaruk Caizapanta Anchapacxi (Quito, January 30, 1970), whose stage name is Amaruk Kayshapanta.  Is an Ecuadorian multidisciplinary artist, known in Spain and Ecuador for his artistic and humanistic trajectory in favor of the Human Rights of Immigration in Spain.  Named as the 'Chasqui de Oro' (In the VI Race and hike 'El Chasqui-NY).  Received the award as 'Cultural Ambassador of the Andes-Mushuk Nina 2014 (Third Edition)', for rescuing the traditions and culture of the Andes for the Indigenous Organizations of Peru, Bolivia based in Ecuador.  He obtained the prize '100 Latinos Madrid', by the Community of Madrid, in recognition of their non-profit altruistic and cultural work for the benefit of foreign immigrants in Spain.  Known for his role in the TV series 'Hospital Central' in which he gave life to the character 'Edgar'.  His Philosophy 'Amawtica Amarukiana Desestructuration' brings to the contemporary world the Philosophical study of the Andean Worldview, a spiritual legacy of transformation and balance for the awakening of a collective conscience."], ["Brown County (county code BR) is a county located in the northeast portion of the U.S. state of Kansas.  As of the 2010 census, the county population was 9,984.  Its county seat and most populous city is Hiawatha.  Brown County is the location of the Kickapoo Indian Reservation of Kansas, the majority of the Sac and Fox Reservation and the majority of the Iowa Reservation of Kansas and Nebraska.", "Brown State Fishing Lake (sometimes also known as Brown State Fishing Lake And Wildlife Area) is a protected area in Brown County, Kansas in the United States.  The lake is 62 acres (0.25 km²) in area and up to 13 feet (4 m) deep.  The area was formerly known as Brown County State Park, and is 8 miles (13 km) east of Hiawatha, Kansas.", "Fishing Lake is a lake in the Canadian province of Saskatchewan.  The lake is located between highway 5 and highway 16, 22 km north of the town of Foam Lake, Saskatchewan, and 24 km east of the town of Wadena, Saskatchewan.  The lake does not have an effective outlet channel, and so is prone to flooding.  Record floods in 2007 resulted in a plan by the Government of Saskatchewan to lower the level of the lake by digging a drainage channel.  The Fishing Lake First Nation opposed this plan, and instead flood control berms were constructed.", "Osage State Fishing Lake is located in northern Osage County, Kansas.  It is a mile east of US 75.  Scranton, Kansas, is to the lake's northwest and Overbrook, Kansas, is to the northeast.  Osage Lake is a freshwater man-made lake, constructed in 1955.  It has a surface area of 140 acres, The parkland in which the lake is contained has 366 acreas of land, mostly tall grass prairie with numerous wooded areas.  The lake is owned by the State of Kansas.", "Neosho State Fishing Lake, also known as Lake McKinley is located in the state of Kansas.  Located 5 mi north on highway 59 and 4 mi east on 40th Rd from the city of Parsons, Kansas, USA.  Construction of this lake was completed in 1927.  The lake covers 92 acre of water.  There are 124 public use acres surrounding the lake.  Fishing, camping, and picnicking are popular activities.  The park has a shelter house, fishing piers, picnic tables, barbecue grills, vault toilets and water hydrant.  Below Lake McKinley dam is a catch and release youth fishing pond for anglers age 15 and under when with an accompanying adult.  The lake is operated by the Kansas Department of Wildlife and Parks.", "Narrow Hills Provincial Park is provincial park in Saskatchewan, Canada.  It contains a series of recreational facilities and a variety of lakes within its boundaries.  These include the Gem Lakes, Lower Fishing Lake, Upper Fishing Lake and others.", "Shawnee State Fishing Lake is approximately eight miles northwest of Topeka, Kansas, and is in northern Shawnee County, Kansas.  This lake is sometimes confused with Lake Shawnee, on the east side of Topeka.  It is a 135 acre surface area lake with a maximum depth of 25 ft .  This is a manmade freshwater lake, which was constructed in the late 1960s.  The lake is widest at the dam, which is at the south end of the lake.  It can be reached by a number of roads.  The only asphalted road reaching it is on the southeast corner.  To the north is 94th Street and on the west side is Humphrey Road.", "Higgins Lake is a small unincorporated community along the southern and western shores of Higgins Lake, a recreational and fishing lake in Roscommon County, in the U.S. state of Michigan.  Higgins Lake is the name of the post office for the area, with ZIP code 48627.  This ZIP code includes several other small communities and locales along the shores of the lake, including (moving counter-clockwise around the lake) Hillcrest, Lyon Manor, Detroit Park, Cook Corner, Sharps Corner, Almeda Beach, Oak Grove, Ritz Corner, Pine Bluffs, and Cottage Grove.  Since all have Higgins Lake as a postal address, they are often all considered as part of the Higgins Lake community.  The lake is situated on the boundary between Lyon Township on the west and Gerrish Township on the east.  US 127 passes on the west side of the lake while I-75 and M-18 both pass a few miles to the east.  Houghton Lake is just a few miles to the south.", "Higgins Lake is a large recreational and fishing lake in Roscommon County, in the U.S. state of Michigan.  The 9,900 acre (40 km²) lake is known for its deep, clear waters and is the 10th largest in Michigan with a shoreline of 21 mi .  It is named after Sylvester Higgins, the first chief of the topographical department of the Michigan Geological Survey.  It has a maximum width of 4 mi and a length of 7 mi with a maximum depth of 135 ft .  The mean depth is 44 ft and the lake contains almost 20 billion cubic feet (570 million m³) of water.  Its retention time is about 12.5 years.  The lake's watershed covers 19,000 acres (77 km²).  The twin-lobed lake receives half of its water from submerged springs, six percent from incoming streams, and the remainder from direct rainfall and runoff.  It drains into Marl Lake by the Cut River which runs into Houghton Lake and eventually to Lake Michigan.  A mile north of the lake, water flows into the Lake Huron watershed.", "Commanda Lake (or Lake Commanda) is a lake in central Ontario, Canada.  Located on the border between Patterson Township and Pringle Township, in the Almaguin Highlands region of the District of Parry Sound, it is fed by Gee Creek, Commanda Creek and Beaudry Creek and is drained by the Restoule River.  The Lake is shaped like the number '3', its middle spur is called Deep Bay.  The lake is home to one permanent island, located off a point in its east.  This is a mud bottom lake and its water is 'tea coloured.'  On the north shore of the lake is the community of Restoule, but cottages line many of the shore lines.  Lots of crown land also surrounds the lake shore making it a very peaceful lake for people of all ages to enjoy.  This lake has one public boat launch towards the southern end of the lake accessible on Commanda Lake Road.  The lake is located at an altitude of 222 m (729 ft) above sea level.  The lake is home to the Northern pike, Walleye, Smallmouth bass and Largemouth bass species of fish.  Ice gets thick in the winter making this lake an all year round fishing lake."], ["Henry John Kaiser (May 9, 1882 – August 24, 1967) was an American industrialist who became known as the father of modern American shipbuilding.  He established the Kaiser Shipyards, which built Liberty ships during World War II, after which he formed Kaiser Aluminum and Kaiser Steel.  Kaiser organized Kaiser Permanente health care for his workers and their families.  He led Kaiser-Frazer followed by Kaiser Motors, automobile companies known for the safety of their designs.  Kaiser was involved in large construction projects such as civic centers and dams, and invested in real estate.  With his wealth, he established the Kaiser Family Foundation, a nonprofit, non-partisan, charitable organization.", "Kaiser Ventures (formerly Kaiser Steel) corporation, headquartered in Ontario, California.  It was founded by Henry J. Kaiser to provide steel plate for the Pacific Coast shipbuilding industry, which expanded during World War II, then shrank, then expanded again during the Korean War.  California Shipbuilding Corporation on Terminal Island, California, was one of these shipyards which built hundreds of Liberty ships and Victory ships in World War II, and was also a project of Henry Kaiser.  Kaiser Steel was noted for making the most of its costly steelmaking inputs, and it captured, along with the U.S. Steel plant in Utah, much of the Pacific Coast steel market by the late 1950s.  Its assets included steelmaking plants in Napa, California (that it acquired from Basalt Rock Company in 1955) and Fontana, California (now operated by California Steel Industries), and a former open-pit iron ore mine at Eagle Mountain, California.  Steel manufactured was also used in Kaiser Motors.", "Edgar Fosburgh Kaiser Jr. (July 5, 1942 – January 11, 2012) was an American-Canadian financier and a former owner of the Denver Broncos American football team.  He was born in Portland, Oregon on July 5, 1942 and is the grandson of shipbuilding industrialist Henry J. Kaiser.  He earned a BA degree from Stanford University and an MBA degree from Harvard University.  Kaiser served as a White House Fellow and as a Special Assistant to President Lyndon B. Johnson, President Richard M. Nixon, and as a Special Assistant to U.S. Secretary of the Interior Walter J. Hickel.  He became a Canadian citizen in 1980.  He died on January 11, 2012.", "Nutri Ventures (also known as Nutri Ventures – The Quest for the 7 Kingdoms) (Portuguese: Nutri Ventures - Em Busca dos 7 Reinos) is a Portuguese TV series produced by the Nutri Ventures Corporation that is distributed through Hulu Kids.", "The Eagle Mountain Railroad (EMRR) was a private railroad in California, owned by the Kaiser Steel Corporation, and is owned today by Kaiser Steel's successor, Kaiser Ventures, Inc. of Ontario, California.", "Neafie, Levy & Co., commonly known as Neafie & Levy, was a Philadelphia shipbuilding and engineering firm that existed from the middle of the 19th to the beginning of the 20th century.  Described as America's 'first specialist marine engineers', Neafie & Levy was probably the first company in the United States to combine the building of iron ships with the manufacture of steam engines to power them.  The company was also the largest supplier of screw propellers to other North American shipbuilding firms in its early years, and at its peak in the early 1870s was Philadelphia's busiest and most heavily capitalized shipbuilder.", "The Kaiser Shipyards were seven major shipbuilding yards located on the United States west coast during World War II.  Kaiser ranked 20th among U.S. corporations in the value of wartime production contracts.  The shipyards were owned by the Kaiser Shipbuilding Company, a creation of American industrialist Henry J. Kaiser, (1882-1967), who established the shipbuilding company around 1939 in order to help meet the construction goals set by the United States Maritime Commission for merchant shipping.", "John Roach & Sons was a major 19th-century American shipbuilding and manufacturing firm founded in 1864 by Irish-American immigrant John Roach.  Between 1871 and 1885, the company was the largest shipbuilding firm in the United States, building more iron ships than its next two major competitors combined.  It was also by far the largest contractor to the U.S. Navy during this period, and at its peak is said to have been the nation's largest employer behind the railroads.", "The New York Shipbuilding Corporation (or New York Ship for short) was an American shipbuilding company that operated from 1899 to 1968, ultimately completing more than 500 vessels for the U.S. Navy, the United States Merchant Marine, the United States Coast Guard, and other maritime concerns.  At its peak during World War II, NYSB was the largest and most productive shipyard in the world.  Its best-known vessels include the destroyer  , the cruiser  , the aircraft carrier  , the nuclear-powered cargo ship NS 'Savannah', and a quartet of cargo-passenger liners nicknamed the 'Four Aces'.", "Edgar Fosburgh Kaiser Sr. (July 29, 1908 – December 7, 1981) was an American industrialist, who was Chairman of Kaiser Aluminum and Chemical Corporation, the Kaiser Cement Corporation and the Kaiser Steel Corporation."], ["The International Boxing Federation (IBF) is one of four major organizations recognized by the International Boxing Hall of Fame (IBHOF) which sanction world championship boxing bouts, alongside the World Boxing Association (WBA), World Boxing Council (WBC) and World Boxing Organization (WBO).", "Vincent Edwards 'Vince' Phillips (born July 23, 1963) is an American former professional boxer who competed from 1989 to 2007.  He held the IBF junior welterweight title from 1997 to 1999, notably scoring an upset victory against then-undefeated Kostya Tszyu to become champion.", "Ralph Charles (born 5 February 1943) is an English amateur welterweight and professional light welter/welter/light middle/middleweight boxer of the 1960s and '70s who as an amateur won the Amateur Boxing Association of England (ABAE) 1959 Junior Class-A title against Kenneth 'Ken'/'Kenny' J. Cooper  (Warley ABC), boxing out of West Ham Boys & ABC, won the Amateur Boxing Association of England (ABAE) 1960 Junior Class-B title against J. Harwood (National Association of Boys Clubs), boxing out of West Ham Boys & ABC, and was runner-up for the 1963 Amateur Boxing Association of England welterweight title, against Johnny Pritchett (Bingham & District ABC), boxing out of West Ham ABC, and as a professional won the British Boxing Board of Control (BBBofC) Southern Area welterweight title, BBBofC British welterweight title, European Boxing Union (EBU) welterweight title, and Commonwealth welterweight title, and was a challenger for the World Boxing Council (WBC) welterweight title, and World Boxing Association (WBA) World welterweight title against José Nápoles, his professional fighting weight varied from 140 lb , i.e. light welterweight to 157 lb , i.e. middleweight.", "George Leslie 'Bunny' Grant (born 29 September 1940) is a Jamaican professional feather/super feather/light/light welter/welterweight/light middleweight boxer of the 1950s, '60s and '70s who won the Jamaican lightweight title, Jamaican welterweight title, Central American light welterweight Title, Latin American junior welterweight title, and British Commonwealth lightweight title, and was a challenger for the World Boxing Council (WBC) light welterweight title and World Boxing Association (WBA) World light welterweight title against Eddie Perkins, Commonwealth welterweight title against Clyde Gray, his professional fighting weight varied from 125+1/2 lb , i.e. featherweight to 152+1/2 lb , i.e. light middleweight.  Bunny Grant was managed by Jacques Deschamps, and Pancho Rankine (circa 1962), and trained by Harry Wiley (circa 1962).", "Andrew 'The Eagle' Murray (1 July 1971 — 26 January 2002 (aged 30)) born in Georgetown was a Guyanese professional welter/light middle/middleweight boxer of the 1990s and 2000s who won the World Boxing Council (WBC) FECARBOX welterweight title, World Boxing Association (WBA) Fedelatin welterweight title, and Commonwealth welterweight title, and was a challenger for the World Boxing Association (WBA) World welterweight title against Ike Quartey, World Boxing Union (WBU) welterweight title against Michele Piccirillo, and World Boxing Organization (WBO) North American Boxing Organization (NABO) light middleweight title against Fathi Missaoui, his professional fighting weight varied from 145 lb , i.e. welterweight to 156 lb , i.e. middleweight.  Andrew Murray was trained by Emanuel Steward, and was the Vice-President of the Guyana Amateur Boxing Board and was training several young boxers, and he had coached Hugo Lewis to the Guyanese super featherweight title on 26 December 2001.  Andrew Murray died in a traffic collision on the Soesdyke-Linden Highway early in the morning of Sunday 27 January 2002, he had been in Linden promoting a fight card and was on his way back to Georgetown.", "Fatai 'Kid Dynamite' Onikeke ( (1983--) 02 1983 (age (2017)-(1983)-((11)<(04)or(11)==(04)and(30)<(02)) ) ) is a Nigerian/Australian professional light welter/welterweight boxer of the 2000s and 2010s who won the Nigerian welterweight title, African Boxing Union (ABU) welterweight title, World Boxing Foundation (WBFo) Intercontinental light welterweight title, International Boxing Federation (IBF) Pan Pacific light welterweight title, and Commonwealth welterweight title, and was a challenger for the World Boxing Organization (WBO) Africa light welterweight title, WBFo light welterweight title, and World Boxing Organization (WBO) Oriental light welterweight title against Lance Gostelow , his professional fighting weight varied from 138+1/2 lb , i.e. light welterweight to 146+1/2 lb , i.e. welterweight.", "Julian 'Fighting Farrier' Holland ( (1972--) 13 1972 (age 45 ) ) born in Bendigo is an Australian professional welter/light middleweight boxer of the 1990s and 2000s who won the Queensland (Australia) State welterweight title, Pan Pacific welterweight title, Australian welterweight title, Oceanic Boxing Association welterweight title, Australasian welterweight title, Pan Pacific light middleweight title, World Boxing Organization (WBO) Asia Pacific welterweight title, and Commonwealth light welterweight title, his professional fighting weight varied from 143 lb , i.e. welterweight to 154 lb , i.e. light middleweight.", "Jeff 'Flash' Malcolm (born 9 May 1956 in Cowra, New South Wales), is an Australian professional boxer who fought from 1971 until 2002.  He won the Australian light welterweight title, New South Wales (Australia) State lightweight title, Australasian light welterweight title, South Pacific light welterweight title, Queensland (Australia) State welterweight title, International Boxing Council (IBC) welterweight title, South Pacific welterweight title, World Boxing Federation (WBF) Intercontinental welterweight title, WBF welterweight title, Pan Asian Boxing Association (PABA) welterweight title, World Boxing Association (WBA) Fedelatin welterweight title, PABA light middleweight title, and Commonwealth light welterweight title.  He was also a challenger for the South Seas light welterweight title against Pat Leglise, Australian welterweight title against Wilf Gentzen, and World Boxing Organization (WBO) welterweight title against Manning Galloway.  His professional fighting weight varied from 135 lb , i.e. lightweight to 165+1/4 lb , i.e. super middleweight.  He was inducted into the Australian National Boxing Hall of Fame in 2007.", "Zabdiel Judah (born October 27, 1977) is an American professional boxer.  He is a four-time former world champion in two weight classes, having held the IBF and WBO junior welterweight titles between 2000 and 2004; the IBF junior welterweight title again in 2011; and the undisputed welterweight title in 2005, which included a reign as the lineal champion from 2005 to 2006.", "Lawrence 'Baby Casius' Austin ( (1956--) 22 1956 (age (2017)-(1956)-((11)<(01)or(11)==(01)and(30)<(22)) ) ) born in Warrnambool is an Australian professional super feather/light/light welter/welter/light middle/middleweight boxer of the 1970s and '80s who won the West Australia State welterweight title, West Australia State light middleweight title, Victoria State light middleweight title, Australian lightweight title, Australian light welterweight title, Australian welterweight title, South Seas Light Middleweight Title, and Commonwealth light welterweight title (twice), and was a challenger for the Australian light middleweight title against Russell Sands, and Commonwealth light welterweight title against Jeff Malcolm, his professional fighting weight varied from 128 lb , i.e. super featherweight to 159 lb , i.e. middleweight.  He was inducted into the Australian National Boxing Hall of Fame in 2008."], ["Oranjegekte (Orange craze) or Oranjekoorts (Orange fever) is a phenomenon in the Netherlands that occurs during major sporting events, especially international football championships, and during Koningsdag, an annual holiday celebrating the king's birthday.  It manifests itself in the wearing of orange clothing such as T-shirts, caps and scarfs; lavish attention for sports and sports fans in the media; and the decoration of cars, rooms, houses, shops, and even entire streets in orange, the traditional color of the Dutch royal family, the House of Orange-Nassau.", "Koningsdag (] ) or King's Day is a national holiday in the Kingdom of the Netherlands.  Celebrated on 27 April (26 April if the 27th is a Sunday), the date marks the birth of King Willem-Alexander.", "Queen's Day or 'Koninginnedag' is the former name of a national holiday in the Netherlands, the Netherlands Antilles and Aruba from 1890 to 2013.  It has since been renamed King's Day or 'Koningsdag' to honor the birthday of King Willem-Alexander.", "Children's Day (こどもの日 , Kodomo no Hi ) is a Japanese national holiday which takes place annually on May 5, the fifth day of the fifth month, and is the final celebration in Golden Week.  It is a day set aside to respect children's personalities and to celebrate their happiness.  It was designated a national holiday by the Japanese government in 1948.  It has been a day of celebration in Japan since ancient times.", "Garifuna Settlement Day is a public holiday in Belize, celebrated each year on November 19.  The holiday was created by Belizean civil rights activist, Thomas Vincent Ramos, in 1941.  It was recognized as a public holiday in the southern districts of Belize in 1943, and declared a national holiday in 1977.  The holiday celebrates the settlement of the Garifuna people in Belize after being exiled from the Grenadines by the British army.  The major festivities for the holiday occur in the town of Dangriga, including parades, street music, and traditional dancing.", "Jounen Kwéyòl (Creole Day) is celebrated in Saint Lucia on the last Sunday of October across the entire island, and has been held annually since 1984.  On the Sunday of this week, the various towns chosen to host this festival put out the result of their grand preparations; local dishes and foods such as roast breadfruit, Green Fig and Salt Fish (The National Dish of Saint Lucia), plantain, king fish, Manicou (opossum), Souse (a soup made with pork and often cucumber), fried bake and floats, Accra (a fried dough which contains salt fish), Paime (otherwise known as Conkies) and a famous dish known as Bouillon (fish, chicken or meat stewed with dasheen, yams, plantains, banana and dumplings) Also local drinks such as Cocoa Tea, Golden Apple Juice, Guava Juice and more.  Apart from the food part, the event is collaborated with kweyol music some of which have been past down to and from many generations.  The most widely used instrument besides vocals are the Tambos (drums) and are beaten throughout as people speak in the creole language and have a merry time.  Most people commemorate this day by wearing the island's National Wear such as the Wob Dwiete.  Persons who do not want to wear the extreme layers of skirts and dresses make clothing out of special plaid material called Madras which is one of the cloths used in the national wear.  Among the places which celebrate it every year are Mon Repos and Dennery.", "The Eighth was a federal holiday in the United States from 1828 until 1861.  It honored the Battle of New Orleans, which took place on January 8, 1815, with Tennessee's Andrew Jackson leading a successful battle against regular British soldiers and freed slaves.  The holiday was celebrated widely across the US South after this final battle in the War of 1812.  'The Eighth' became an official national holiday in 1828, following Jackson's election as President.  The Eighth continued as an official national holiday from 1828 until the advent of the American Civil War.", "Saint-Jean-Baptiste Day (French: 'Fête de la Saint-Jean-Baptiste' ), officially known in Quebec as the National Holiday, (French: 'la fête nationale' ) is a holiday celebrated annually on June 24, the feast day of the Nativity of St. John the Baptist.  In Quebec, it is a public holiday with festivities occurring on June 23 and 24 which are publicly financed and organized by a 'Comité organisateur de la fête nationale' (National Holiday Organizing Committee).  June 24 is also celebrated as a festival of French Canadian culture in other Canadian provinces and the United States.", "White Sunday is a national holiday in Samoa falling on the second Sunday of October, with the Monday following a public holiday.  It is a day for parents and communities to acknowledge and celebrate childhood by hosting special programs during church services which include scriptural recitations.  Biblical story reenactments, and creative dance performances.  Children receive gifts (often new clothing and/or school supplies) on White Sunday and are allowed privileges normally reserved for elders, such as being the first to be served food at family meal time.", "Christmas in the Basque Country starts with the of Santo Tomas on 21 December, a celebration in which most people go out onto the streets to dance and eat talo with txistorra (a type of Basque chorizo).  They wear a traditional outfit called the casera dress.  For girls it consists of a long skirt and a long-sleeved old-fashioned shirt with headscarves and aprons.  The boys wear a long black shirt, trousers and txapela (traditional black beret).  The casera outfits are normally dark blue, but can come in many colors.  They wear caseras because that is what the people of the mountain wear and the holiday used to celebrate the peasants who sold their goods in town and came on Santo Tomas to pay rent to landlords in the city."], ["Bobbi Bacha is a Texas Private Investigator portrayed in 2004 TV Sony Pictures Movie 'Suburban Madness' played by actress Sela Ward.  Bobbi Bacha also was involved and worked on the case of New York millionaire Robert Durst who was charged with murder in Galveston, Texas for killing his neighbor Morris Black but was found not guilty by a Galveston County Jury.", "Sela Ann Ward (born July 11, 1956) is an American actress, author and producer, best known for her roles on television beginning in the early '80s.", "Barend or (somewhat dated spelling) Barent is a Dutch male given name and occasional middle name.  As of 2014, there are over than 4,000 men in the Netherlands with this as their first name, and nearly 3,000 with it as their middle name.  It was likely derived from Bernard.  Notable people with the name include:", "Marion Christopher Barry was born in June 1980 to Marion Barry and Barry's third wife, Effi Slaughter Barry.  He was their only child.  His father had wanted to name him Marion Barry III, but Effi was strongly opposed, and they decided to give him the middle name Christopher instead.  For most of his adult life, Barry went by his middle name, Christopher.", "Suburban Madness is an American crime drama television film, based on a true story, starring Sela Ward as PI Bobbi Bacha of Blue Moon Investigations.  It aired on CBS on October 3, 2004.", "Latvian names, like in most European cultures, consist of two main elements: the given name ('vārds') followed by family name ('uzvārds').  During the Soviet occupation (1940 - 1991) the practice of giving a middle name was discouraged, but since the restoration of Independence Latvian legislation again allows giving of up to two given names and it has become more common to give a middle name to children.", "Singh is a title, middle name or surname, which originated in India.  Derived from the Sanskrit word for lion, it was adopted as a title by certain warrior castes in India.  It was mandated by Guru Gobind Singh for all Sikhs.  It was later adopted by several castes and communities.  As a surname or a middle name, it is now found throughout the Indian subcontinent and among the Indian diaspora, cutting across communities and religious groups, becoming more of a title than a surname.", "Jeff Strabone is a Brooklyn-based American scholar, political activist and civic leader.  In 2016, his website 'directelection.org' listed the names and addresses of members of the U.S. Electoral College, and he urged people to write to electors to ask them not to vote for president-elect Donald Trump, an effort which brought him national attention.  As a civic leader in Brooklyn, he has been active in promoting theatre preservation, building codes and housing issues, hospital preservation, and traffic flow.  He has been a leader of Brooklyn's Cobble Hill Association, a neighborhood preservation group.  He is the co-founder and chairman of the New Brooklyn Theatre.  In 2008, he changed his middle name to 'Hussein' as a show of solidarity with then presidential candidate Barack Obama, who was running for the office of president, and who had been criticized for his Muslim-sounding middle name.  He is an associate professor of English and teaches British and African literature, and he was granted tenure at Connecticut College in 2016.  He commented about the post-election effort:", "Christopher Funk is an American musician and multi-instrumentalist best known as a member of the Portland, Oregon, indie rock band The Decemberists.  He plays guitar, pedal steel, piano, violin, dobro, hurdy-gurdy, mandolin, saxophone, the theremin and many other instruments.  According to Colin Meloy, as stated at the Pilgrimage Festival in Franklin, TN on September 27, 2015, Funk was originally given the middle name 'Ryman' but a clerical error on his birth certificate resulted in his middle name being recorded as 'Lyman.'", "In several cultures, people's names usually include one or more names in addition to the portion that is usually considered adequate to identify them.  In a number of cultures where a given name is expected to precede the surname, such a name is likely to be placed after the given name and before the surname, and thus called a middle name.  In English-speaking American culture, that term is often applied (arguably mistakenly) to names, occupying that position, even if the bearer would insist that that name is being mistakenly called a 'middle name', and is actually (to mention several types of atypical cases):"], ["The 1925 Birthday Honours were appointments by King George V to various orders and honours to reward and highlight good works by citizens of the British Empire.  The appointments were made to celebrate the official birthday of The King, and were published in 'The London Gazette' on 3 June 1925.", "George V (George Frederick Ernest Albert; 3 June 1865 – 20 January 1936) was King of the United Kingdom and the British Dominions, and Emperor of India, from 6 May 1910 until his death in 1936.", "The 2017 Queen's Birthday Honours are appointments by some of the 16 Commonwealth realms of Queen Elizabeth II to various orders and honours to reward and highlight good works by citizens of those countries.  The Birthday Honours are awarded as part of the Queen's Official Birthday celebrations during the month of June.  The Queen's Birthday Honours for the United Kingdom were announced on 16 June; the honours for New Zealand were announced on 5 June and for Australia on 12 June.", "The 2014 Birthday Honours were appointments by some of the 16 Commonwealth realms of Queen Elizabeth II to various orders and honours to reward and highlight good works by citizens of those countries.  The Birthday Honours are awarded as part of the Queen's Official Birthday celebrations during the month of June.  The Queen's Birthday Honours were announced on 14 June 2014 in the United Kingdom, on 9 June 2014 in Australia, on 2 June 2014 in New Zealand, on 14 June 2014 in Grenada, Papua New Guinea, Solomon Islands, Tuvalu, Saint Lucia and Belize.", "The 2015 Queen's Birthday Honours are appointments by some of the 16 Commonwealth realms of Queen Elizabeth II to various orders and honours to reward and highlight good works by citizens of those countries.  The Birthday Honours are awarded as part of the Queen's Official Birthday celebrations during the month of June.  The Queen's Birthday Honours were announced on 1 June 2015 in New Zealand, on 8 June in Australia, and on 12 June in the United Kingdom, in Grenada, Papua New Guinea, Solomon Islands, Tuvalu, Saint Lucia and Belize.", "The 2016 Queen's Birthday Honours are appointments by some of the 16 Commonwealth realms of Queen Elizabeth II to various orders and honours to reward and highlight good works by citizens of those countries.  The Birthday Honours are awarded as part of the Queen's Official Birthday celebrations during the month of June.  The Queen's Birthday Honours were announced on 6 June 2016 in New Zealand and 10 June in the United Kingdom.", "King's/Queen's Birthday Honours is, in some Commonwealth realms, the marking of the reigning monarch's official birthday by granting various individuals appointment into national or dynastic orders or the award of decorations and medals.  The honours are presented by the monarch or a viceregal representative.  New Year Honours and Birthday Honours are bestowed each year.  All royal honours are published in the relevant gazette, and the daily newspapers of each realm.", "The Queen's Birthday Honours 1965 were appointments in many of the Commonwealth realms of Queen Elizabeth II to various orders and honours to reward and highlight good works by citizens of those countries.  The appointments were made to celebrate the official birthday of The Queen.  The announcement date varies from year to year.  The 1965 Queen's Birthday Honours were announced on 12 June for the United Kingdom, Australia, New Zealand, Sierra Leone, Jamaica, Trinidad and Tobago, Malawi, and the Gambia.", "The King's Birthday Honours 1951 were appointments in many of the Commonwealth realms of King George VI to various orders and honours to reward and highlight good works by citizens of those countries.  The appointments were made to celebrate the official birthday of the King, and were published on 1 June 1951 for the British Empire, Australia, New Zealand, Ceylon, and Pakistan.  These were the last Birthday Honours awarded by George VI, who died eight months later.", "The 2013 Birthday Honours were appointments by some of the 16 Commonwealth realms of Queen Elizabeth II to various orders and honours to reward and highlight good works by citizens of those countries.  The Birthday Honours are awarded as part of the Queen's Official Birthday celebrations during the month of June.  The Queen's Birthday Honours were announced on 15 June 2013 in the United Kingdom, on 10 June 2013 in Australia on 3 June 2013 in New Zealand, on 15 June 2013 in Grenada, Papua New Guinea, Solomon Islands, Tuvalu, Saint Lucia and Belize."], ["In addition to comic books, Mutarelli has also created plays, books, and all the illustration and animated sequences of the 2004 motion picture 'Nina', which was based on the novel 'Crime and Punishment' by Dostoyevsky.", "Crime and Punishment (Russian: Преступлéние и наказáние , 'Prestupleniye i nakazaniye'; ] ) is a novel by the Russian author Fyodor Dostoyevsky.  It was first published in the literary journal 'The Russian Messenger' in twelve monthly installments during 1866.  Later, it was published in a single volume.  It is the second of Dostoyevsky's full-length novels following his return from 5 years of exile in Siberia.  'Crime and Punishment' is considered the first great novel of his 'mature' period of writing.", "The Golden Hour is a children's novel by Maiya Williams.  It was first published in 2004 and is the first of the Golden Hour time travel series.  It tells the story of Rowan Popplewell and his sister, Nina, who, while emotionally disturbed by the death of their mother, travel back in time to the French Revolution.", "Quando Eu Era Vivo (English: When I Was Alive ) is a 2014 Brazilian drama-thriller film directed by Marco Dutra, based on the novel 'A Arte de Produzir Efeito Sem Causa' by Lourenço Mutarelli.", "Spirit of the Border is an historical novel written by Zane Grey, first published in 1906.  The novel is based on events occurring in the Ohio River Valley in the late eighteenth century.  It features the exploits of Lewis Wetzel, a historical personage who had dedicated his life to the destruction of Native Americans and to the protection of nascent white settlements in that region.  The story deals with the attempt by Moravian Church missionaries to Christianize Indians and how two brothers' lives take different paths upon their arrival on the border.  A highly romanticized account, the novel is the second in a trilogy, the first of which is 'Betty Zane', Grey's first published work, and 'The Last Trail', which focuses on the life of Jonathan Zane, Grey's ancestor.", "Before We Say Goodbye, first published as Prima di Lasciarsi, is a 2004 novel by Gabriella Ambrosio.  The work is based on the 2002 Kiryat HaYovel supermarket bombing and narrates the final hours in the lives of the suicide bomber and her victims.  It was first published in Italy in 2004 through Nutrimenti, and was later published in English on 2 August 2010 through Walker Books.  The novel has been published in multiple languages, including Arabic and Hebrew, and has been endorsed by Amnesty International.", "4 a.m. is the debut novel of Scottish author Nina de la Mer.  It was first published in the UK on 26 August 2011 by Brighton-based publishing house Myriad Editions.  The novel draws on the author's personal experiences and research, covering rave culture of the 90s and peacetime life in the British Army.", "Three Comrades (German: 'Drei Kameraden' ) is a novel first published in 1936 by the German author Erich Maria Remarque.  It is written in first person by the main character Robert Lohkamp, whose somewhat disillusioned outlook on life is due to his horrifying experiences in the trenches of the First World War's French-German front.  He shares these experiences with Otto Köster and Gottfried Lenz, his two comrades with whom he runs an auto-repair shop in late 1920s Berlin (probably).  Remarque wrote the novel in exile and it was first published in Dutch translation as 'Drie kameraden', with English translation following soon in 'Good Housekeeping' from January to March 1937 and in the book form in the same year.  First German language edition was published in 1938 by exile publisher 'Querido' in Amsterdam, but the novel was published in Germany only in 1951.", "Drained, (Portuguese: O Cheiro do Ralo_ is a 2006 Brazilian dark comedy film based on a novel by Lourenço Mutarelli.  It was directed by Heitor Dhalia, and stars Selton Mello.  The film was produced by Geração Conteúdo, Primo Filmes & RT Features.", "The Birds on the Trees is a novel by Nina Bawden first published in 1970 about a middle-class English family whose 19-year-old son does not live up to his parents' expectations."], ["Viglen Ltd provides IT products and services, including storage systems, servers, workstations and data/voice communications equipment and services.", "Bordan Tkachuk ( ) is a British business executive, the former CEO of Viglen, also known from his appearances on the BBC-produced British version of 'The Apprentice,' interviewing for his boss Lord Sugar.", "Cardinal Health, Inc. is a Fortune 500 health care services company based in Dublin, Ohio.  The company specializes in distribution of pharmaceuticals and medical products, serving more than 100,000 locations.  The company also manufactures medical and surgical products, including gloves, surgical apparel and fluid management products.  In addition, it operates the nation’s largest network of radiopharmacies.  Cardinal Health provides medical products to over 75 percent of hospitals in the United States.  In December 2013, it was announced that Cardinal Health would team up with CVS Caremark, which would form the largest generic drug sourcing operation in the United States.  The venture was named Red Oak Sourcing and began operations in July 2014.", "Terren Scott Peizer dubbed the 'Zelig of Wall Street' is currently the Chairman of his personal Los Angeles-based investment company, Acuitas Group Holdings (AGH), which in turn owns 100% of Crede Capital Group (CCG) which invests in public companies, and provides growth capital to small and medium-sized enterprises.  Since its inception in June 2009, CCG has provided companies with capital commitments and funding in excess of $1.2 Billion.  Besides its ownership of Crede Capital, Acuitas Group owns 72% of Catasys, Inc., a provider of proprietary big data based analytics and predictive modeling driven behavioral health management services for health plans; and owns 100% of NeurMedix, Inc., a biotech company that develops and commercializes disease modifying small molecules to treat neuro-degenerative diseases, such as Parkinson’s disease, Alzheimer’s disease, Migraine disease, Huntington’s disease, ALS, MS, Epilepsy, Traumatic Brain Injury, and Retina disease.  Peizer is Founder, Chairman of the three Acuitas companies, and is CEO of Catasys, Inc. and Crede Capital Group.  Having developed a bioscience and healthcare expertise, Peizer’s Crede Capital became the largest shareholder in 22nd Century Group, Inc., a public company that is commercializing bio-plant technology to harm-reduce tobacco, creating very low nicotine and very low tar tobacco products which affect levels of addiction and cancer causing carcinogens.  On October 1, 2015 New England Journal of Medicine published a landmark study on the company’s very low nicotine spectrum cigarettes.  In October 2014, Peizer and 22nd Century formed a JV to commercialize the company’s products in China with China National Tobacco Company, the largest tobacco company in the world and the largest monopoly in China.  China represents over 50% of the worldwide tobacco market.", "BankUnited, Inc., with total consolidated assets of $27.9 billion at December 31, 2016, is a bank holding company with one wholly owned subsidiary, BankUnited, collectively, the Company.  BankUnited, a national banking association headquartered in Miami Lakes, Florida, provides a full range of banking services to individual and corporate customers through 94 banking centers located in 15 Florida counties and 6 banking centers in the New York metropolitan area.  The Bank also provides certain commercial lending and deposit products on a national platform.  The Company endeavors to provide, through experienced lending and relationship banking teams, personalized customer service and offers a full range of traditional banking products and services to both commercial and retail customers.", "Compass Minerals International, Inc is a United States listed public company that, through its subsidiaries, is a leading producer of minerals, including salt, magnesium chloride, sulfate of potash and other plant nutrition products.  Based in Kansas City, the company provides bulk treated and untreated highway deicing salt to customers in North America and the United Kingdom and plant nutrition products to growers worldwide.  Compass Minerals also produces consumer deicing and water conditioning products, consumer and commercial culinary salt, and other mineral-based products for consumer, agricultural, and industrial applications.  In addition, Compass Minerals provides records management services to businesses throughout the United Kingdom.", "Owens & Minor () is a Fortune 500 company based in Mechanicsville, Virginia, just outside of Richmond.  Owens & Minor, Inc. is a healthcare logistics company specializing in contracting packages of healthcare products for hospitals.  Owens and Minor's tagline is 'Connecting the World of Medical Products to the Point of Care'.  The company provides supply chain services to healthcare providers and manufacturers of healthcare products, including disposable medical supplies as well as devices and implants.  Owens and Minor has logistics operations in the United States and Europe, where three quarters of global healthcare spending occurs.  Owens & Minor’s customers span the healthcare market from independent hospitals to large integrated healthcare networks, as well as group purchasing organizations, healthcare products manufacturers, and the federal government.  Owens & Minor is headquartered in Mechanicsville, Virginia, and has annualized revenues exceeding $9 billion.", "Kingstone Companies, Inc., which has its headquarters in Kingston, New York, provides property and casualty insurance products through its subsidiary, Kingstone Insurance Company.  It places contracts with the third-party licensed premium finance company through its subsidiary Payments, Inc, a NYS licensed Insurance Premium Finance Company.  Kingstone Insurance Company was ranked #1 of the 81 insurers rated by the Professional Insurance Agents Association in its 2010 Company Performance Survey.  The company sells insurance products include personal lines of insurance products, general liability policies commercial automobile policies and so on through independent retail and wholesale agents and brokers.", "Jonathan M. Ansell (born August 13, 1950 in Binghamton, New York) is an American entrepreneur and CEO in the insurance and insurtech industry.  Ansell is the founder and CEO of insurtech companies Merlinio Technologies and Merlinio Insurance Services, an online digital insurance agency and technology platform serving the millennial market.  Before Merlinio, Ansell was a co-founder and CEO of Fusion Company, a global digital merchandising provider that specializes in ancillary products.  Fusion was created in 2012 after being spun-out of a large international insurance company.  Previously Ansell was the President, CEO and one of the co-founders of what is now Allianz Global Assistance USA, one of the largest travel insurance companies in the US and American specialty insurer Jefferson Insurance Company.  He was also a member of the management board of Allianz Global Assistance, formerly Mondial Assistance, an international travel insurance and assistance company based in Paris, France.", "Clean Power Finance, headquartered in San Francisco, California, is a financial services and software company for the residential solar industry.  Clean Power Finance operates the CPF Market, an online business-to-business platform that connects institutional investors and lenders with residential solar professionals who need solar finance products to grow their businesses.  Clean Power Finance provides the solar industry with CPF Tools, a solar sales, quoting and design software-as-a-Service (SaaS) solution: qualified residential solar channel partners access finance products through the software.  Third-party investors create solar project finance funds; Clean Power Finance provides origination, underwriting and asset management services to the fund investors and markets investor capital to solar professionals as residential finance products, including solar leases and power purchase agreements (PPAs)."], ["George Raft (born George Ranft; September 26, 1901 – November 24, 1980) was an American film actor and dancer identified with portrayals of gangsters in crime melodramas of the 1930s and 1940s.  A stylish leading man in dozens of movies, today Raft is mostly known for his gangster roles in the original 'Scarface' (1932), 'Each Dawn I Die' (1939), and Billy Wilder's 1959 comedy 'Some Like it Hot', as a dancer in 'Bolero' (1934), and a truck driver in 'They Drive by Night' (1940).", "Johnny Angel is a 1945 film noir directed by Edwin L. Marin and written by Frank Gruber and Steve Fisher from the novel 'Mr. Angel Comes Aboard' by Charles Gordon Booth.  The movie stars George Raft, Claire Trevor and Signe Hasso, and features Hoagy Carmichael.", "Johnny Angel Wendell is an American writer, musician, and radio talk show host.  He is married and lives in Los Angeles with his two sons.  Once a resident of Massachusetts, he is now a Los Angeles Weekly columnist, Wendell is the host of KTLK-AM 1150's 'Southern California Live with Johnny Wendell'.  Wendell is also a regular on KFI-AM640.", "Michele Ann Marie Fabares ( ; born January 19, 1944) is an American actress and singer, known professionally as Shelley Fabares.  She is best-known for her roles as Donna Reed's daughter Mary Stone on 'The Donna Reed Show' (1958–1963), and as Hayden Fox's love interest (and eventual wife) Christine Armstrong on the sitcom 'Coach' (1989–1997).  She was Elvis Presley's co-star in three films.  In 1962, her recording of 'Johnny Angel' reached number one on the 'Billboard' Hot 100 chart.", "Cool from the Wire is the major-label debut album from American hard rock band Dirty Looks.  It was released in 1988 on Atlantic Records.  It includes the song 'Oh Ruby', that received airplay on rock stations.  'It’s Not the Way You Rock' was used in the film Johnny Be Good, and appeared on its soundtrack.  The album peaked #134 in 'Billboard' 200.", "William D. Russell (April 30, 1908 - April, 1968) was an American film and television director.  Born in Indianapolis, Indiana on April 30, 1908, he began his Hollywood career with the 1945 film 'Hollywood Victory Caravan'.  His career in film ended with his last film, 1951's 'Best of the Badmen'.  In the early fifties he began directing for television with Screen Gems, and his many credits include episodes of 'Father Knows Best' (he was with the show from 1954 to 1956), 'Dennis the Menace', 'Perry Mason', 'Hazel', 'Bewitched', 'the Farmer's Daughter' and 'Family Affair'.  Russell was nominated for three Emmys, first for 'You Are There' in 1953, second for 'the Farmer's Daughter' in 1964, and later for 'Family Affair' in 1967.  His directorial career ended shortly before his death in April 1968.", "Johnny Lee Clary (June 18, 1959 – October 21, 2014) was an American man who served as a Ku Klux Klan leader before he became a Pentecostal Christian, traveling around the world preaching the gospel and teaching against racism and hate groups such as the Ku Klux Klan, Neo Nazis, and the Aryan Nations.  Clary was also known as professional wrestler Johnny Angel who had success in the 1980s in the National Wrestling Federation (NWF).", "Karl Gösta Prüzelius (11 August 1922 – 15 May 2000) was a Swedish actor.  His first film part was in the 1945 film Flickorna i Småland.  He played in films as diverse as 'Summer with Monika', 'Space Invasion of Lapland', 'Fanny and Alexander', and Ingmar Bergman's film version of 'The Magic Flute' (1975).  He also provided the Swedish voice for Bagheera in Disney's 'The Jungle Book' (1967), and played the policeman Klöverhage in a number of the Åsa-Nisse films.", "'Johnny Angel' is a song written and composed by Lyn Duddy and Lee Pockriss.  The song was originally recorded by both Laurie Loman and Georgia Lee, however these two versions were not successful.  It first became a popular hit single in 1962 when covered by Shelley Fabares who took it to number one on the 'Billboard' Hot 100 Chart.  British singer Patti Lynn had a moderate hit with her cover of 'Johnny Angel' the same year on the UK Singles Chart.  The American pop music duo The Carpenters also covered 'Johnny Angel' in 1973 as part of a medley of oldies on side two of their album 'Now & Then'.", "Claudia Drake (January 30, 1918 – October 19, 1997) was an American actress and singer.  She appeared in a number of B Movies in a mixture of leading and supporting roles.  She starred in the 1945 film noir 'Detour'."], ["The 2000 ICC KnockOut Trophy was a One Day International cricket tournament held in Kenya (which helped to booster cricket in Kenya).  New Zealand were crowned champions and cashed the winner's cheque of US$250 000.  It was their first win in a major ICC tournament.  Zaheer Khan, Yuvraj Singh and Marlon Samuels made their ODI debuts during the competition.", "Zaheer Khan (born 7 October 1978) is a former Indian cricketer who played all forms of the game for Indian national cricket team from 2000 till 2014.  He was the second-most successful Indian pace bowler in Test cricket, behind Kapil Dev.", "The 1998 ICC KnockOut Trophy (officially known as Wills International Cup, also known as Mini World Cup) was a One Day International (ODI) cricket tournament held in Bangladesh.  It was the first tournament apart from the World Cups to involve all Test playing nations.  The winners of the Knock-out stage—India, South Africa, Sri Lanka and Indies—reached the semi-finals.  South Africa made their way to the final by defeating Sri Lanka in the first semi-final by 92 runs; the match was reduced to 39 overs per innings due to rain.  In the second semi-final, West Indies defeated India by six wickets, and qualified for the final.", "These were the eleven squads (all Test nations and two ODI nations) picked to take part in the 2000 ICC KnockOut Trophy, the second installment of the Champions Trophy cricket tournament.  The tournament was held in Kenya from 3 to 15 October 2000.  In the preliminary quarter finals, two ODI full-status teams Kenya and Zimbabwe played with India and Sri Lanka respectively, and India and Sri Lanka won their matches convincingly.  In third preliminary quarter final, England beat Bangladesh to secure his position in Knockout Tournament.  New Zealand won the second edition of the ICC KnockOut Trophy by defeating India in the final by four wickets, which was their first ICC event to be won.", "Lindum Sports Club Ground is a cricket ground in Lincoln, Lincolnshire.  The first recorded match on the ground was in 1861, when Lincolnshire played an All-England Eleven.  Lincolnshire played their first Minor Counties Championship match at the ground in 1907 against Staffordshire.  Lincolnshire used the ground during a number of periods during the 21st century, playing their final Minor Counties Championship match at the ground in 2000 against Cumberland.  The first MCCA Knockout Trophy watch played the ground saw Lincolnshire play Bedfordshire in 1996.  From 1996 to 2007, the ground held 4 MCCA Knockout Trophy matches, with the final match played on the ground to date against Lincolnshire and Staffordshire.", "Guy Philip Randall-Johnson (born 8 December 1959) is a former English cricketer and umpire from Crediton, Devon.  Randall-Johnson initially played Minor counties cricket for Devon between 1987 and 1991.  In 1993, Randall-Johnson first stood as an umpire in a Minor Counties Championship match between Dorset and Wales Minor Counties.  Two years later he stood in his first MCCA Knockout Trophy match, played between Cornwall and Devon.  He stood in his first List A match in the 1999 NatWest Trophy played between the Somerset Cricket Board and Bedfordshire.  Between 1999 and 2003 he stood in 7 List A matches, the last of which he stood was between Dorset and Buckinghamshire in the 1st round of the 2004 Cheltenham & Gloucester Trophy which was held in 2003.  Randall-Johnson stood as an umpire in Minor counties cricket until 2008, by which time he had stood in 54 Minor Counties Championship matches and 25 MCCA Knockout Trophy matches.  He made headlines in 2006 for walking out of a Minor Counties Championship match after being on the receiving end of abuse from Berkshire players after he gave Berkshire captain Julian Wood out LBW.  After not getting an apology from the players, he walked out of the game, with others having to deputise for him.", "These were the nine squads (all Test nations) picked to take part in the 1998 ICC KnockOut Trophy, the first installment of the Champions Trophy cricket tournament.  The tournament was held in Bangladesh from 24 October to 2 November 1998.  Teams could name a preliminary squad of 30, but only 14-man squads were permitted for the actual tournament, one month before the start of the tournament.  In the knockout tournament, New Zealand and Zimbabwe were the only teams to play a pre-quarter final match.  New Zealand won the match and qualified for the quarter-final where they faced Sri Lanka.  South Africa won the inaugural edition of the ICC KnockOut Trophy by defeating West Indies in the final by four wickets.", "Davies made his 2nd XI debut for Glamorgan vs MCC young cricketers and has to date made over 25 appearances for the county.  He later made his Test Match debut for Wales Minor Counties against Lincolnshire in the 2009 MCCA Knockout Trophy.  His Minor Counties Championship debut came in the same season against Shropshire.  To date he has made fourteen Minor Counties Championship and ten MCCA Knockout Trophy appearances.  While studying for a degree in Sports Coaching at the University of Wales Institute, Cardiff, Davies made his debut in first-class cricket for Cardiff MCCU against Somerset in 2012 at Taunton Vale Sports Club Ground, making scores of 42 and 14.", "Peter William Kingston-Davey (22 October 1940) is a former English cricket umpire from Tiverton, Devon.  In 1995, Kingston-Davey first stood as an umpire in a Minor Counties Championship match between Dorset and Wales Minor Counties.  Two years later he stood in his first MCCA Knockout Trophy match, played between Dorset and Wales Minor Counties.  He stood in his first List A match in the 1999 NatWest Trophy played between Devon and Berkshire.  Between 1999 and 2003 he stood in 5 List A matches, the last of which he stood in was between Devon and Suffolk in the 1st round of the 2004 Cheltenham & Gloucester Trophy which was held in 2003.  Peter-Kingston stood as an umpire in Minor counties cricket until 2006, by which time he had stood in 39 Minor Counties Championship matches and 15 MCCA Knockout Trophy matches.", "Digswell Park is a cricket ground in Welwyn Garden City, Hertfordshire.  The first recorded match on the ground was in 1866 between The Node and Southgate.  In 2000, the ground hosted its only Minor Counties Championship match to date, which was between Hertfordshire and Cambridgeshire.  In 2003, the ground hosted 2 MCCA Knockout Trophy matches.  Hertfordshire resumed their usage of Digswell Park and have to date played 4 further MCCA Knockout Trophy matches on the ground."], ["Caroline Carver (born 1976) is an English actress, screenwriter, and producer best known for roles such as Princess Jessica in the TV film 'The Magical Legend of the Leprechauns' (1999), Ingrid in 'The Aryan Couple' (2004), and Sandy in 'My First Wedding' (2006).", "The Magical Legend of the Leprechauns is a 1999 Hallmark Entertainment made-for-TV fantasy movie.  It stars Randy Quaid, Colm Meaney, Kieran Culkin, Roger Daltrey, Caroline Carver and Whoopi Goldberg.  The film contains two main stories that eventually intertwine: the first being the story of an American businessman who visits Ireland and encounters magical leprechauns and the second, a story of a pair of star-crossed lovers who happen to be a fairy and a leprechaun, belonging to opposing sides of a magical war.  It contains many references to Romeo and Juliet such as two lovers taking poison and feuding clans.", "Donald J. Hall Jr., is the President and Chief Executive Officer of Hallmark Cards, and a director of Crown Media Holdings, a member of the board of directors of Hallmark Entertainment Holdings and of the Business Men's Assurance Company of America.  He is the son of Donald J. Hall Sr., the chairman of the board and controlling shareholder of Hallmark Cards.", "Silver Bells is a 2005 made-for-television drama film starring Anne Heche and Tate Donovan.  It was produced by Hallmark Entertainment as a Hallmark Hall of Fame movie and was based on the novel of the same name by Luanne Rice.", "La Femme Musketeer is a made for television movie produced by Hallmark Entertainment and Larry Levinson Productions, filmed on Draguć in Croatia.  It originally premiered on June 20, 2004 on Hallmark Channel.", "The Boys Next Door is a 1996 television movie based on a play by Tom Griffin which was published in 1983 under the title 'Damaged Hearts, Broken Flowers' and again in 1988 under the title 'The Boys Next Door'.  The movie was produced by Hallmark Entertainment as a Hallmark Hall of Fame Movie.", "Snow White: The Fairest of Them All is a 2001 fantasy adventure television film co-written and directed by Caroline Thompson and produced by Hallmark Entertainment.  The film was first released theatrically in Europe, and subsequently aired in the United States on ABC as part of their series on 'The Wonderful World of Disney' on March 17, 2002.", "You Me and Captain Longbridge (2008) is a 15 minutes short film directed by Kenny Doughty and written & produced by Caroline Carver.  The film stars Callum Williams as the 11-year-old Luke, Chris Larkin as Captain Longbridge and Joseph Fiennes as the voice of Luke as an adult.  The short film played in 12 International Film Festivals and won 3 awards.", "Snow Queen is a 2002 made-for-television film made by Hallmark Entertainment, directed by David Wu, and based on the story 'The Snow Queen' by Hans Christian Andersen.  The film stars Bridget Fonda as the title character and Chelsea Hobbs as her rival and the story's heroine, Gerda.  The film originally aired on Hallmark Channel as a two-part miniseries, but has since been released as a full-length film on DVD in the United States.  The DVD came out on November 9, 2009, in the United Kingdom, and on September 2, 2011, in Australia.  This was Bridget Fonda's last acting role to date.", "Family Plan is a made-for-television movie filmed in Los Angeles by Mat IV Productions in association with Alpine Media and Larry Levinson Productions and presented by Hallmark Entertainment.  It premiered on February 12, 2005 on Hallmark Channel, as part of their Valentine's Day celebration.  This is the feature film debut of Chloë Grace Moretz"], ["The Market Theater Gum Wall is a brick wall covered in used chewing gum, in an alleyway in downtown Seattle.  It is located in Post Alley under Pike Place Market.  Similar to Bubblegum Alley in San Luis Obispo, California, the Market Theater Gum Wall is a local landmark.  Parts of the wall can be covered several inches thick, 15 feet high for 50 feet.", "San Luis Obispo ( ; Spanish for 'St. Louis, the Bishop [of Toulouse]'), or SLO for short, is a city in the U.S. state of California, located roughly midway between Los Angeles and San Francisco on the Central Coast.  The population was 45,119 at the 2010 census.  The population of San Luis Obispo County was 269,637 in 2010.", "The Old US 67 Rest Area is a historic roadside rest area in rural Clark County, Arkansas.  It is located in on the west side of U.S. Route 67 (US 67) and an old paved section formerly designated Highway 51, between the small towns of Curtis and Gum Springs.  The rest area consists of a semicircular fieldstone retaining wall, which is segmented by six fieldstone pillars.  A semicircular concrete bench stands facing a fieldstone well.  The rest area was built five years after US 67 was paved in 1931, by the National Youth Administration, a federal New Deal agency, and the state highway department.", "The Philadelphia Baseball Wall of Fame is a collection of plaques, mounted on a brick wall in the Ashburn Alley section of Citizens Bank Park, the ballpark of the Philadelphia Phillies.  From 1978 to 2003, the Phillies inducted one figure from their franchise history and one notable person from the Philadelphia Athletics (A's) organization each year—with the exception of 1983, when the Phillies inducted their Centennial Team.  Once Veterans Stadium closed in 2003, the wall plaques used to recognize the Phillies' members were moved to Citizens Bank Park; however, the Phillies no longer induct notable Athletics.  Each person inducted into the Wall of Fame was honored with a metal plaque showing the person's face; their position with, and years of service to, the team; and a summary of their most important contributions.  In March 2004, the Athletics' plaques were relocated to the Philadelphia Athletics Historical Society in Hatboro, Pennsylvania, and a single plaque listing all of the A's inductees was attached to a statue of Connie Mack located across the street from Citizens Bank Park.", "Ouch!  is a type of sugar-free bubble gum made by the Wm. Wrigley Jr.  Company under the Hubba Bubba brand name.  By the 1990s, the gum was available in the flavors of grape, watermelon, and strawberry.  Each stick of gum was wrapped with paper made to look like a bandage and was packaged in a metallic container similar to that of a bandage box.  In October 2009, the gum was redesigned to have a new look and packaging, and is now also available in bubblegum flavor.  Each pack comes with one of a possible twenty collectable games inside.", "Hollywood Star Lanes was a 32-lane bowling alley located on Santa Monica Boulevard in Los Angeles, California.  Open from 1960 to 2002, the alley was featured in the movies 'The Big Lebowski' and 'The Big Empty', which was filmed on location over three weeks of the eleven-week filming schedule.  In 2002, the alley was closed after the Los Angeles Unified School District seized the land by eminent domain, with the goal of building an elementary school at the site.", "The Digital Media Factory is a multi-media design, production and post-production facility founded by Marty Collins and wife, Ginny Mitchell along with partners Ned Hearn and Brian Critchlow.  They are located in Santa Cruz, California in the former Wrigley Gum manufacturing facility located at 2809 Mission Street on the west end of Santa Cruz.", "The Up Your Alley Fair, most commonly referred to by locals as Dore Alley Fair or simply Dore Alley is a leather and fetish event held in San Francisco, California on the last Sunday of July on Folsom Street between 9th and 10th Streets and on Dore Street from Howard Street to half a block southeast of Folsom Street.  The streets are lined with vendors' booths, and a sound stage (for dancing) is located at the 10th Street end of Folsom Street.", "Lower Louviers and Chicken Alley, also known as Louviers and Duck Street, is a historic home located near Wilmington, New Castle County, Delaware.  It was built in 1811, and is a two- to three-story, five bay, stuccoed stone dwelling.  The three center bays project slightly from the main body of the house.  In 1935, a kitchen wing was added to the other end of the house plus a gated wall and garage.  The house was owned by the Du Pont family.  Also on the property is 'Chicken Alley,' an excellent example of the 19th century workers' row house.", "Bubblegum Alley is a tourist attraction in downtown San Luis Obispo, California, known for its accumulation of used bubble gum on the walls of an alley.  It is a 15 ft high and 70 ft long alley lined with chewed gum left by passers-by.  It covers a stretch of 20 meters in the 700 block of Higuera Street in downtown San Luis Obispo."], ["Jillian Leigh Bell (born April 25, 1984) is an American comedian, actress, and screenwriter.  She is best known for her recurring roles as Jillian Belk on 'Workaholics' and Dixie on the final season of 'Eastbound & Down', as well as appearing in '22 Jump Street' and 'Fist Fight' (2017).", "SuperMansion is an American stop-motion animated comedy television series created by Matthew Senreich and Zeb Wells.  The series stars Bryan Cranston, Heidi Gardner, Tucker Gilmore, Keegan-Michael Key, Tom Root, Yvette Nicole Brown, Zeb Wells, and Jillian Bell.  The series premiered on Crackle on October 8, 2015.", "Helen Modern (born 16 February 1983) is an English actress best known for her recurring role as Naomi in British sitcom, 'Respectable' on Five.  In 2006 she also starred in the eighth series of ITV1 drama 'Bad Girls' as inmate Stella Gough, the daughter of Governing Governor Joy Masterton.  As well as her featured roles in 'Respectable' and 'Bad Girls', Helen has also had a recurring role in BBC One daytime soap opera, 'Doctors' (2005) as Diane Bishop and various roles in 'No Angels', 'Wire in the Blood', 'The Chase' and 'Messiah - The Harrowing' with Ken Stott and Maxine Peake.", "Mitchell Craig 'Mitch' Pileggi (born April 5, 1952) is an American actor, best known for his role as Walter Skinner on 'The X-Files'.  He also had a recurring role on 'Stargate Atlantis' as Colonel Steven Caldwell.  He appeared in the 2008 film 'Flash of Genius'.  In 2008, he began a recurring role as Ernest Darby in 'Sons of Anarchy'.  He starred as Harris Ryland in the TNT revival of 'Dallas' (2012–2014).", "John Allen Amos Jr. (born December 27, 1939) is an American actor who is best known for his role as James Evans, Sr. on the CBS television series 'Good Times' (1974–76).  Amos' other television work includes roles in 'The Mary Tyler Moore Show', the miniseries 'Roots', for which he received an Emmy nomination, and a recurring role as Admiral Percy Fitzwallace on 'The West Wing'.  Amos also played the father of Will Smith's character's girlfriend, Lisa Wilkes, in 'The Fresh Prince of Bel-Air', and he had a recurring role on 'In the House' with LL Cool J, as Coach Sam Wilson.  Amos played the Father of Tommy Strawn (Thomas Mikal Ford) on the long running sitcom, 'Martin', as Sgt. Strawn, and another recurring role on 'Two and a Half Men' as Chelsea's dad's new lover, Edward Boynton.  Amos also played Major Grant, the US Special forces officer in 'Die Hard 2'.  Amos has also appeared on Broadway and in numerous films in a career that spans four decades.  He has received nominations for a Primetime Emmy Award and NAACP Image Award.", "Hilarie Ross Burton (born July 1, 1982) is an American actress and producer.  A former host of MTV's 'Total Request Live', she portrayed Peyton Sawyer on the The WB/CW drama 'One Tree Hill' for six seasons (2003–09).  Burton gained wider recognition with leading roles in the films 'Our Very Own', 'Solstice' and 'The List'.  She starred as Sara Ellis on the USA crime drama 'White Collar' (2010–13); and, in 2013, she had a recurring role as Dr. Lauren Boswell on the ABC medical drama 'Grey's Anatomy'.  In 2014, she appeared in the short-lived ABC drama series 'Forever' as Molly Dawes, and a recurring role in the short-lived CBS sci-fi drama series 'Extant' as Anna Schaefer in 2015.  In 2016, Burton was cast in a recurring role as DEA Agent Karen Palmer on the Fox action dramedy series 'Lethal Weapon'.", "Jo Marie Payton (born August 3, 1950) is an American television actress and singer who starred as Harriette Winslow, the matriarch of the Winslow family on the ABC/CBS sitcom 'Family Matters', and also appeared in a recurring role on its parent series 'Perfect Strangers'.  From 2001 to 2005, Payton provided the voice for Suga Mama Proud on Bruce W. Smith's Disney Channel's 'The Proud Family'.  The role earned her an NAACP Image Award nomination in 2005.  Payton also had a recurring role as the personal assistant to Gregory Hines' character, Ben Doucette (Will Truman's boss), during season two of 'Will & Grace' (1999–2000).", "Jenna Dewan Tatum (born Jenna Lee Dewan; December 3, 1980) is an American actress and dancer.  She began her career as a backup dancer for Janet Jackson, and later worked with artists including Pink, Missy Elliott, and Christina Aguilera.  She is known for her role as Nora Clark in the 2006 film 'Step Up'.  She has also starred on the short-lived NBC series 'The Playboy Club' and had a recurring role on the FX series 'American Horror Story'.  She was Freya Beauchamp on the Lifetime series 'Witches of East End' and as of 2016 was playing the recurring role of Lucy Lane in 'Supergirl'.", "John Pappas (born November 11, 1951) is an American actor, playwright and former comic who has appeared on television and in film since the 1970s.  Pappas is best known for his recurring role as 'Pappas' on the television series Hardball (NBC 1989-1990).  Pappas is also known for his recurring role of Leo Sullivan on the NBC Soap Opera 'Days of Our Lives' (NBC1994).  In 2001 Pappas returned to 'Days of Our Lives' in another recurring role of a convict named 'Buddy'.  Pappas is an award-winning actor receiving a 1990 best actor award from the L.A. Weekly, for his performance in Gilbert Girion’s BAD COUNTRY.  He received 2 Drama-Logue awards, one in 1989 and another in 1988.", "Jeffrey Lane 'Jeff' Hephner (born June 22, 1975) is an American actor, known for his recurring role as Matt Ramsey in the third season of the Fox drama 'The O.C.' (2005-2006) and starring as Morgan Stanley Buffkin in the short-lived CW comedy-drama 'Easy Money' (2008-2009).  He had a recurring role as football coach Red Raymond in the short-lived CW drama 'Hellcats' and co-starred as Ben Zajac in the Starz political drama 'Boss' (2011–2012) with Kelsey Grammer.  In 2015, he starred as John Case in the short-lived TNT action drama 'Agent X'.  Hephner had a recurring role as firefighter-turned-medical student Jeff Clarke in NBC's 'Chicago' franchise in the original drama 'Chicago Fire' from 2013 to 2014 and reprised his role in the show's medical drama spin-off 'Chicago Med' from 2016 to 2017."], ["The Reading Post (until 2009, the Reading Evening Post), was an English local newspaper covering Reading, Berkshire and surrounding areas.  The title page of the paper featured the Maiwand Lion, a famous local landmark at Forbury Gardens.  The paper was most recently published by Surrey & Berkshire Media Ltd., a division of Trinity Mirror plc.", "The Maiwand Lion is a sculpture and war memorial in the Forbury Gardens, a public park in the town of Reading, in the English county of Berkshire.  The statue was named after the Battle of Maiwand and was erected in 1884 to commemorate the deaths of 329 men from the 66th (Berkshire) Regiment of Foot during the campaign in the Second Anglo-Afghan War in Afghanistan between 1878 and 1880.  It is sometimes known locally as the Forbury Lion.", "Kargil War Memorial, also known as the Vijaypath, is a war memorial built by the Indian Army, located in Dras, in the foothills of the Tololing Hill.  The memorial is located about 5 km from the city centre across the Tiger Hill.  It is located on the Srinagar-Leh National Highway 1D.  The memorial is in the memory of the soldiers and officers of the Indian Army who were killed during the 1999 conflict between India and Pakistan.  The conflict later became known as the 'Kargil War'.  The memorial has a huge epitaph with names of all the officers and soldiers who died in war.  Kargil Vijay Diwas is celebrated on 26 July every year at the memorial simultaneously the Prime Minister of India pays tribute to the soldiers at Amar Jawan Jyothi at the India Gate, New Delhi. The main attraction of the whole memorial is the Sandstone wall, in the open, which has the names of all the Indian army personnel, who laid their lives during the Kargil war besides there is also a souvenir shop.  Visitors to the memorial can also see from there, some of the peaks that the Indian army captured back from Pakistan.  A giant national flag, weighing 15 kg was hoisted at the Kargil war memorial to commemorate the 13th anniversary of India’s victory in the war", "The Devon County War Memorial is a First World War memorial, designed by Sir Edwin Lutyens and situated on the cathedral green in Exeter, the county town of Devon, in the south west of England.  It is one of fifteen War Crosses designed by Lutyens to a similar specification, and one of two to serve as a civic memorial in a city.  The first proposal for the county's war memorial was to complete the construction of a cloister at Exeter Cathedral to be dedicated to the Devon's war dead, but this scheme was abandoned due to lack of funds.  After considering multiple proposals, the Devon County War Memorial Committee commissioned Lutyens to design a War Cross instead.  The committee chose to site the memorial on the green of Exeter Cathedral after scouting several locations.  A war memorial for Exeter itself was being considered concurrently, but the committees for the two projects failed to work together, resulting in two separate memorials—the county memorial by the cathedral and Exeter City War Memorial in Northernhay Gardens.", "Manchester Cenotaph is a First World War memorial, with additions for later conflicts, by Sir Edwin Lutyens in St Peter's Square in Manchester, England.  Manchester was late in commissioning a war memorial compared to most British towns and cities—the city council did not convene a war memorial committee until 1922.  The committee quickly raised £10,000 but finding a suitable location for the monument proved controversial.  The preferred site in Albert Square, requiring the removal and relocation of several statues, was opposed by the city's artistic community.  The next choice was Piccadilly Gardens, an area ripe for development, but in the interests of expediency, the council chose St Peter's Square, although it already contained a memorial cross to the former St Peter's Church.  Negotiations to move the cross were unsuccessful and the war memorial was built with the cross in situ.", "The York City War Memorial is a First World War memorial designed by Sir Edwin Lutyens and located in York in the north of England.  Proposals for commemorating York's war dead originated in 1919 but proved controversial.  Initial discussions focused on whether a memorial should be a monument or should take on some utilitarian purpose.  Several functional proposals were examined until a public meeting in January 1920 opted for a monument.  The city engineer produced a cost estimate and the war memorial committee engaged Lutyens, who had recently been commissioned by the North Eastern Railway (NER) to design their own war memorial, also to be sited in York.  Lutyens' first design was approved, but controversy enveloped proposals for both the city's and the NER's memorials.  Members of the local community became concerned that the memorials as planned were not in keeping with York's existing architecture, especially as both were in close proximity to the ancient city walls, and that the NER's memorial would overshadow the city's.  Continued public opposition forced the committee to abandon the proposed site in favour of one on Leeman Road, just outside the walls, and Lutyens submitted a new design of a War Cross and Stone of Remembrance to fit the location.  This was scaled back to the cross alone due to lack of funds.", "Spalding War Memorial is a First World War memorial in the gardens of Ayscoughfee Hall (pronounced ) in Spalding, Lincolnshire, in eastern England.  It was designed by the architect Sir Edwin Lutyens.  The proposal for a memorial to Spalding's war dead originated in January 1918 with Barbara McLaren, whose husband and the town's Member of Parliament, Francis McLaren, was killed in a flying accident during the war.  She engaged Lutyens via a family connection and the architect produced a plan for a grand memorial cloister surrounding a circular pond, in the middle of which would be a cross.  The memorial was to be built in the formal gardens of Ayscoughfee Hall, which was owned by the local district council.  When McLaren approached the council with her proposal, it generated considerable debate within the community and several alternative schemes were suggested.  After a public meeting and a vote in 1919, a reduced-scale version of McLaren's proposal emerged as the preferred option, in conjunction with a clock on the town's corn exchange building.", "The Forbury Hotel (formerly Shire Hall) is a grade II listed hotel in the town of Reading in the English county of Berkshire.  It is situated on the southern side of Forbury Gardens, a public park in the town centre.", "St James's Church is a Roman Catholic church situated in the centre of the town of Reading in the English county of Berkshire.  It is located adjacent to the remaining ruins of Reading Abbey, between the Forbury Gardens and Reading Gaol.", "Forbury Gardens is a public park in the town of Reading in the English county of Berkshire.  The park is on the site of the outer court of Reading Abbey, which was in front of the Abbey Church.  The site was formerly known as the Forbury, and one of the roads flanking the current gardens is still known as The Forbury.  Fairs were held on the site three times a year until the 19th century."], ["The 2014 FIFA World Cup was the 20th FIFA World Cup, the quadrennial world championship for men's national football teams organized by FIFA.  It took place in Brazil from 12 June to 13 July 2014, after the country was awarded the hosting rights in 2007.  It was the second time that Brazil staged the competition, the first being in 1950, and the fifth time that it was held in South America.", "Algeria have appeared in the finals of the FIFA World Cup on four occasions in 1982, 1986, 2010 and 2014.  They have once qualified for the knockout rounds, reaching the round of 16 in 2014 before losing to Germany.  32 years before, Algeria nearly qualified to the second round of the 1982 World Cup after beating both West Germany and Chile; however, an arrangement match between West Germany and Austria wound up eliminating the Algerians.  In 2014, Algeria qualifyed for the first time into the round of 16.", "The opening ceremonies of the 2015 Cricket World Cup took place in New Zealand and Australia on the eve of the beginning of the World Cup hosted by them after 23 years.  Two ceremonies took place at the same time, one in North Hagley Park, Christchurch in New Zealand while the other in Melbourne, Australia.  Thousands of fans turned up to watch the opening ceremony in both locations.  It was the first major sporting event hosted by Christchurch after the deadly 2011 Christchurch earthquake.", "Orvar Bergmark (16 November 1930 – 10 May 2004) was a Swedish football defender and manager.  He was the second Swedish national manager ever, and managed to qualify the Swedish national football team for the FIFA World Cup in Mexico 1970, after having beaten France (among others) in the qualifications.  The 1970 World Cup was the first one in 12 years, and it was also the first time in 20 years that Sweden had 'qualified' for a World Cup.  (Sweden hosted the 1958 FIFA World Cup, and hence did not need to qualify.)  Sweden did not qualify for the World Cups in 1954, 1962 and 1966).", "The 2002 FIFA World Cup was the 17th staging of the FIFA World Cup which took place from 31 May to 30 June 2002 in South Korea and Japan.  It was the first World Cup to be held in Asia, the first to be held on a continent other than Europe or the Americas, the last World Cup during which the golden goal rule was in force and the only World Cup to be jointly hosted by more than one nation.  Brazil won the tournament for a record fifth time, winning the final against Germany 2–0.  The victory meant Brazil qualified for the 2005 FIFA Confederations Cup for the fifth time, representing the World.  In the third place play-off match against South Korea, Turkey won 3–2 taking third place in only their second ever FIFA World Cup finals.  China PR, Ecuador, Senegal and Slovenia made their first appearances at the finals with Turkey making its first appearance since 1954.  Republic of Ireland, Russia and Sweden returned after missing the 1998 tournament.", "The 1991 Rugby World Cup was the second edition of the Rugby World Cup, and was jointly hosted by England, Scotland, Wales, Ireland and France; at that time, the five European countries that participated in the Five Nations Championship making it the first Rugby World Cup to be staged in the northern hemisphere, with England as the host of the championship game.  Following on from the success of the inaugural 1987 Rugby World Cup, the 1991 World Cup received increased attention and was seen as a major global sporting event for the first time.  Also for the first time qualifying competitions were introduced as the number of entrants had increased from 16 nations four years before to a total of 33 countries, the eight quarter-finalists from 1987 qualified automatically with the remaining 25 countries having to qualify for the remaining eight spots.  This however resulted in only one new side qualifying for the tournament, Western Samoa replacing Tonga.  The same 16-team pool/knock-out format was used with just minor changes to the points system.", "The Ukraine's National Football Team (Ukrainian: Збірна України з футболу ) is the national football team of Ukraine and is controlled by the Football Federation of Ukraine.  After Ukrainian Independence and the country's breakaway from the Soviet Union, they played their first match against Hungary on 29 April 1992.  The team's biggest success on the world stage was reaching the quarter-finals in the 2006 FIFA World Cup, which also marked the team's debut in the finals of a major championship.  As the host nation, Ukraine automatically qualified for UEFA Euro 2012.  Four years later, Ukraine qualified for Euro 2016 via the play-off route, the first time qualifying for a UEFA European Championship via the qualifying process, as it finished in third place in its qualifying group.  This marked the first time in Ukraine's five play-off appearances that it managed to win such a tie, previously unsuccessful in the play-off ties for the Euro 2000, 2002 World Cup, 2010 World Cup and 2014 World Cup.", "The 1968–1969 season was the 66th season of competitive football in Belgium.  Standard Club Liégeois won their 4th Division I title.  No Belgian club managed to pass the second round of the European competitions, though for the first time 6 Belgian clubs qualified (1 more club qualified for the Inter-Cities Fairs Cup).  K Lierse SK won the Belgian Cup final against RR White (2-0).  The Belgium national football team continued their 1970 FIFA World Cup qualification campaign with 3 home wins against all other Group 6 teams (Finland, Yugoslavia and Spain) and a draw in Spain.  Belgium qualified for the 1970 FIFA World Cup finals in Mexico with one match to go.  For the first time since the 1954 FIFA World Cup, Belgium would qualify for a major tournament.", "The Tertiary Student Rugby League World Cup, also known as the University Rugby League World Cup, first took place in 1986 in New Zealand, when the then five test nations each entered a side in what was the first non-first grade World Cup hosted by the Rugby League International Federation.", "The Switzerland women's national football team represents Switzerland in international women's football.  The team played its first match in 1972.  Their most recent competition is qualification for the 2015 FIFA Women's World Cup, and they had qualified as the best team in their group.  It would be the first time that Switzerland participated in a women's World Cup, and the first time both the men's team and women's team qualified for a World Cup simultaneously.  Switzerland qualified for the European Championship for the first time in 2017.  They have never qualified for the Olympic games."], ["Kelly Lee Osbourne (born 27 October 1984) is a British singer-songwriter, actress, television presenter and fashion designer.  The daughter of Ozzy and Sharon Osbourne, she is known for her appearances on 'The Osbournes' with her family, for which they won a 2002 Emmy Award for Outstanding Reality Program, as well as on E!'s 'Fashion Police', where she was a presenter from 2010 to 2015.  She has also appeared on 'Dancing with the Stars', in which she and her professional dance partner Louis van Amstel took third place.  She is the voice of Hildy Gloom in the Disney XD animated series 'The 7D'.  She is also a judge on both 'Australia's Got Talent' and 'Project Runway Junior'.", "The 16th Annual Young Hollywood Awards were held on Monday, July 28, 2014 in Los Angeles, California, previously recorded the day before.  Kelly Osbourne hosted the show, with Justin Bieber being honored for his charity work and contributions to the Make-A-Wish Foundation, and Vanessa Hudgens was honored with the Trendsetter Award.", "The 15th Annual Young Hollywood Awards were held on Thursday, August 1, 2013 in Los Angeles, California, previously recorded the day before.  Aisha Tyler was the host while there were no nominees this year, the recipients were 'honored' with the awards.  This was the first year that the awards were televised.", "Jeremy Schoenberg (born May 8, 1972), born in Los Angeles County, California, United States.  Jeremy started out as a child star on both film and television.  He played on 'Days of Our Lives' from 1980 to 1982 as Johnny, Marlena's foster child.  Jeremy was nominated for this role in the category of Best Young Actor - Daytime TV Series in the 2nd Annual Young Artist Awards.  He also voiced Linus van Pelt on 'Is This Goodbye, Charlie Brown? '", "The 12th Youth in Film Awards ceremony (now known as the Young Artist Awards), presented by the Youth in Film Association, honored outstanding youth performers under the age of 21 in the fields of film, television and music for the 1989-1990 season.  The exact date of the 12th annual ceremony is unknown, however, using the dates of the 11th and 13th annual awards, the 12th annual ceremony is believed to have taken place in late 1990 or early 1991 in Hollywood, California.", "The Nickelodeon Kids Choice Awards 2003 was held on April 12, 2003.  It was the 16th annual Kids' Choice Awards ('KCA').  It was hosted by Rosie O'Donnell.  The award show was held in the Barker Hangar at the Santa Monica Airport in Santa Monica, California.  This was the last time O'Donnell would host the awards.  By that time she has hosted the awards seven times in a row.  The announcers were Daran Norris and Susanne Blakeslee from 'The Fairly OddParents' who used their Cosmo and Wanda voices, respectively, for the event.", "Maureen Dragone (January 20, 1920 – February 8, 2013) was an American journalist and author.  She was one of the longest-standing members of the Hollywood Foreign Press Association which presents the annual Golden Globe Awards.  In 1978 she founded the Young Artist Association, which presents the annual Young Artist Awards.", "Penske Media Corporation (PMC) is an American digital media, publishing, and information services company founded in 2003.  PMC publishes more than 22 digital brands, including a joint venture in India with ZEE TV for its India.com brand.  The company also produces more than 50 annual events and conferences as well as housing a research and emerging data business.  PMC brands include PMC Studios, WWD, WWD.com, Footwear News, M, Deadline.com, Variety magazine, Variety.com, CricketCountry.com, HollywoodLife, Beauty Inc, GoldDerby.com, India.com, Movieline, TVLine, BGR, AwardsLine, @Hollywood, LA411, NY411, Young Hollywood Awards, The Style Awards, and Breakthrough of the Year Awards.  The company is headquartered in Los Angeles, California and New York, NY with 11 offices around the world.", "Puerto Roc Records is an independent record label that was established in 2006 by founder and sole owner Jonathan 'DJ Primo' Padilla.  The independent label is based out of Miami, Florida and has its main focus on hip hop/rap music.  Puerto Roc Records' main artist is E Grizzly.  E Grizzly released his first E.P. in May 2006 titled 'Hip Hop is Dead!'  and won the 2006 Independent Rap Artist of the Year at the 16th annual L.A. Music Awards in November 2006.  The E.P. was also nominated for Best Breakthrough Album of the year for an independent artist at the 16th Annual L.A. Music Awards.  Puerto Roc Records looks forward to the release of E Grizzly's next main single titled 'Audiograf', which was scheduled to be released in 2008.", "The Young Hollywood Awards was an award presented annually which honors the year's biggest achievements in pop music, movies, sports, television, fashion and more, as voted on by teenagers aged 13–19 and young adults.  The award ceremonies also honor rising and promising young aged performers in Hollywood.  The award ceremony usually features a high number of celebrities and musical performers such as Taylor Swift, Justin Bieber, and Nick Jonas.  New artists such as Black Cards and Brazzabelle have also performed."], ["New York's 1st State Senate district is one of 62 districts of the New York State Senate.  It is currently represented by Senator Kenneth LaValle (R).", "Kenneth P. LaValle (born May 22, 1939 in Brooklyn, New York) represents District 1 in the New York State Senate, which comprises the five East End towns of Long Island, New York, and the eastern half of the Town of Brookhaven, New York.  First elected in 1976, he is the chair of the Higher Education Committee in the State Senate.", "New York's 2nd State Senate district is one of 62 districts of the New York State Senate.  It is currently represented by John J. Flanagan (R).  Senator Flanagan is New York State Senate's majority leader and temporary president.", "'Nesting' is the delimitation of voting districts for one elected body in order to define the voting districts for another body.  For example, in California, the State Assembly (the lower house) is composed of 80 members, each one representing 1/80th of California's population, and the State Senate (the upper house) is composed of 40 members, each one representing 1/40th of California's population.  In this case, the process of nesting could either be first defining the 80 Assembly districts, and then defining the Senate districts as a merge of two Assembly districts, or first defining the 40 Senate districts, and then creating the Assembly districts by splitting each Senate district into two.  If the Assembly districts and the Senate districts are created independently of each other, then the process of nesting is not used.", "The California State Senate is the upper house of the California State Legislature.  Due to the state's large population and relatively small legislature, the State Senate has the largest population per representative ratio of any state legislative house.  In the United States House of Representatives, California is apportioned 53 representatives, each representing approximately 704,566 people, while in the State Senate, each of the 40 Senators represents approximately 931,349 people, with the result that California state senators each actually represent more voters than California's representatives to the United States Congress do.  Each member roughly represents a population equivalent to the state of Delaware.  As a result of Proposition 140 in 1990 and Proposition 28 in 2012, members elected to the legislature prior to 2012 are restricted by term limits to two four-year terms (eight years), while those elected in or after 2012 are allowed to serve 12 years in the legislature in any combination of four-year state senate or two-year state assembly terms.", "New York's 3rd State Senate district is one of 62 districts of the New York State Senate.  It is currently represented by Thomas Croci (R).", "Steven Bradford (born January 12, 1960) is an American politician currently serving in the California State Senate.  He is a Democrat representing the 35th district, encompassing parts of Los Angeles County.  Prior to his election to the state senate, he was an assemblymember for the 62nd district of the California State Assembly.  Bradford was elected to represent the 51st district in a special election held on September 1, 2009, after Curren Price resigned his seat to take a seat in the California State Senate.  He was re-elected in 2010 and, with 72% of the vote, was elected once more to represent the brand new 62nd District, comprising the communities of Del Aire, Del Rey, El Segundo, Gardena, Hawthorne, Inglewood, Lawndale, Lennox, Marina del Rey, West Athens, Westchester, Westmont and Venice Beach.", "Andrea Stewart-Cousins (Democrat, Independence and Working Families) is a New York State Senator and the first woman in New York State history to lead a conference in Albany.  The Yonkers resident represents the 35th State Senate district in New York which in its present configuration includes Ardsley, Dobbs Ferry, Elmsford, Greenburgh, Hastings-on-Hudson, Irvington, Tarrytown, Scarsdale and parts of Yonkers, White Plains, and New Rochelle.  Prior to being elected to the New York State Senate, she was a Westchester County Legislator.  She was elected to the New York State Senate in 2006.  In 2012, her colleagues chose her to be the first female legislative leader; she currently serves as Democratic Conference Leader.", "The Hawaiʻi State Senate is the upper chamber of the Hawaii State Legislature.  The senate consists of twenty-five members elected from an equal number of constituent districts across the islands.  The senate is led by the President of the Senate, elected from the membership of the body, currently Ron Kouchi.  The forerunner of the Hawaii State Senate during the government of the Kingdom of Hawaiʻ i was the House of Nobles originated in 1840.  In 1894 the Constitution of the Republic of Hawaii renamed the upper house the present senate.  Senators are elected to four-year terms and are not subject to term limits.  Like most state legislatures in the United States, the Hawaii State Senate is a part-time body and senators often have active careers outside government.  The lower chamber of the legislature is the Hawaiʻi House of Representatives.  The membership of the Senate also elects additional officers to include the Senate Vice President, Senate Chief Clerk, Assistant Chief Clerk, Senate Sergeant at Arms and Assistant Sergeant at Arms.", "New York's 4th State Senate district is one of 62 districts of the New York State Senate.  It is currently represented by Philip M. Boyle (R)."], ["Tefik Selim Mborja (1888-1954) was an Albanian politician and lawyer.  He served as the general secretary of the Albanian Fascist Party during the Second World War.", "The Albanian Fascist Party (Albanian: 'Partia Fashiste e Shqipërisë' , or PFSh) was a Fascist organization active during World War II which held nominal power in Albania from 1939, when the country was conquered by Italy, until 1943, when Italy capitulated to the Allies.  Afterwards, Albania fell under German occupation, and the PFSh was replaced by the Guard of Greater Albania.", "General elections were held in Sweden on 19 September 1982.  They saw the return of the Swedish Social Democratic Party to power after six years in opposition, the longest period in opposition by the Social Democrats since the 1910s.  The center-right coalition of Thorbjörn Fälldin had earlier suffered a loss upon the breakup of the government in 1981, the year before the election, when the rightist Moderate Party chose to withdraw from the government, protesting against the centrist tax policies of the Fälldin government.  After regaining power, socialist leader Olof Palme succeeded in being elected Prime Minister again, having earlier held power between 1969 and 1976.  He would retain this position successfully until his assassination in 1986.", "Bal'arab bin Himyar (died 1749) was one of the rival Imams during the civil wars in Oman in the final years of the Yaruba dynasty.  He was elected Imam in 1728, holding power in the interior of Oman while his cousin, Saif bin Sultan II, held power on the coast.  In 1737 he renounced his claim after being defeated by Saif's Persian allies.  He was again elected Imam in 1743 during another Persian invasion, and again held power in the interior while Ahmad bin Said al-Busaidi was recognized as ruler by the coastal people.  He died in battle against Ahmad bin Said in 1749.  Ahmad became the undisputed ruler of the country.", "The Confederation of Mexican Workers (Spanish: 'Confederación de Trabajadores de México (CTM)' ) is the largest confederation of labor unions in Mexico.  For many years, it was one of the essential pillars of the Partido Revolucionario Institucional (the Institutional Revolutionary Party, or PRI), which ruled Mexico for more than seventy years.  However, the CTM began to lose influence within the PRI structure in the late 1980s, as technocrats increasingly held power within the party.  Eventually, the union found itself forced to deal with a new party in power after the PRI lost the 2000 general election, an event that drastically reduced the CTM's influence in Mexican politics.", "The United Bermuda Party (UBP) was a political party in Bermuda.  It represented itself as centrist party in favour of a moderate social and fiscal agenda.  Having held power in Bermuda's House of Assembly continuously from 1968 to 1998, the 47-year-old party officially ceased operations on 30 June 2011 after the majority of its members joined the One Bermuda Alliance.", "Federal elections for the House of Representatives were held in Australia on 2 December 1972, and were won by the Australian Labor Party led by Gough Whitlam.  Labor won 67 of the 125 seats contested and defeated the Liberal Party led by Prime Minister William McMahon and Coalition partner the Country Party led by Doug Anthony.  The elections ended 23 years of successive Coalition governments which held power since 1949.", "Albania ( , ; Albanian: 'Shqipëri/Shqipëria' ; Gheg Albanian: 'Shqipni/Shqipnia, Shqypni/Shqypnia' ), officially the People's Socialist Republic of Albania (), was a socialist state that ruled Albania from 1946 to its fall in 1992.  From 1946 to 1976 it was known as the People's Republic of Albania, and from 1944 to 1946 as the Democratic Government of Albania.  Throughout this period the country had a reputation for its Stalinist style of state administration dominated by Enver Hoxha and the Party of Labour of Albania and for policies stressing national unity and self-reliance.  Travel and visa restrictions made Albania one of the most difficult countries to visit or to travel from.  In 1967, it declared itself the world's first atheist state.  It was the only Warsaw Pact member to formally withdraw from the alliance before 1990, an action occasioned by the Warsaw Pact invasion of Czechoslovakia in 1968.  The first multi-party elections in Socialist Albania took place on 31 March 1991 – the communists gained a majority in an interim government and the first parliamentary elections were held on 22 March 1992.  The People's Socialist Republic was officially dissolved on 28 November 1998 upon the adoption of the new Constitution of Albania.", "The fourth legislative assembly election of Madras State (later renamed as Tamil Nadu) was held in February 1967.  The Dravida Munnetra Kazhagam (DMK) led coalition under the leadership of C.N. Annadurai won the election defeating the Indian National Congress (Congress).  Anti-Hindi agitations, the rising prices of essential commodities and a shortage of rice were the dominant issues.  K. Kamaraj's resignation as the Chief Minister in 1963, to concentrate on party affairs, along with persistent rumours of corruption had weakened the incumbent Congress Government.  This was the second time after Communist Party of India winning Kerala assembly elections in 1957, for a non-Congress party to gain majority in a state in India, and the last time that Congress held power in Tamil Nadu.  It was the first time a party or pre-election alliance was formed a nob-Congress government with absolute majority.  It marked the beginning of Dravidian dominance in the politics of Tamil Nadu.  Annadurai, who became the first non-Congress chief minister of post-independence Tamil Nadu, died in office in 1969 and V.R. Nedunchezhiyan took over as acting chief minister.", "The Party of Communists in Hungary (Hungarian: 'Kommunisták Magyarországi Pártja' ), renamed Hungarian Communist Party ('Magyar Kommunista Párt' ) in October 1944, was founded on November 24, 1918, and was in power in Hungary briefly from March to August 1919 under Béla Kun and the Hungarian Soviet Republic.  The communist government was overthrown by the Romanian Army and driven underground.  The party regained power following World War II and held power from 1945 under the leadership of Mátyás Rákosi.  In 1948 the party merged with the Social Democrats to become the Hungarian Working People's Party.  The Communist Party of Hungary was a member of the Communist International."]]}